koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* TCON[UP] - Count up */
#define TCON_UP_MSK                    (0x1   << 2  )
#define TCON_UP                        (0x1   << 2  )
#define TCON_UP_DIS                    (0x0   << 2  ) /* DIS. Timer is set to count down (default) */
#define TCON_UP_EN                     (0x1   << 2  ) /* EN. Timer is set to count up */

/* TCON[PRE] - Prescaler */
#define TCON_PRE_MSK                   (0x3   << 0  )
#define TCON_PRE_DIV1                  (0x0   << 0  ) /* source_clock / [1 or 4]  */
#define TCON_PRE_DIV16                 (0x1   << 0  ) /* source_clock / 16        */
#define TCON_PRE_DIV256                (0x2   << 0  ) /* source_clock / 256       */
#define TCON_PRE_DIV32768              (0x3   << 0  ) /* source_clock / 32,768    */

/* TCLRI[CAP] - Clear captured event interrupt */
#define TCLRI_CAP_MSK                  (0x1   << 1  )
#define TCLRI_CAP                      (0x1   << 1  )
#define TCLRI_CAP_CLR                  (0x1   << 1  ) /* Clear the capture event interrupt */

/* TCLRI[TMOUT] - Clear timeout interrupt */
#define TCLRI_TMOUT_MSK                (0x1   << 0  )
#define TCLRI_TMOUT                    (0x1   << 0  )
#define TCLRI_TMOUT_CLR                (0x1   << 0  ) /* Clears the timeout interrupt */

/* TCAP[CAP] - 16-bit captured value */
#define TCAP_CAP_MSK                   (0xFFFF << 0  )

/* TSTA[PDOK] - TCLRI synchronization */
#define TSTA_PDOK_MSK                  (0x1   << 7  )
#define TSTA_PDOK                      (0x1   << 7  )
#define TSTA_PDOK_CLR                  (0x0   << 7  ) /* CLR. The interrupt is cleared in the timer clock domain */
#define TSTA_PDOK_SET                  (0x1   << 7  ) /* SET. TCLRI[0] is being updated in the timer clock domain */

/* TSTA[BUSY] - Timer Busy */
#define TSTA_BUSY_MSK                  (0x1   << 6  )
#define TSTA_BUSY                      (0x1   << 6  )
#define TSTA_BUSY_CLR                  (0x0   << 6  ) /* CLR. Timer ready to receive commands to TCON */
#define TSTA_BUSY_SET                  (0x1   << 6  ) /* SET. Timer not ready to receive commands to TCON */

/* TSTA[CAP] - Capture event pending */
#define TSTA_CAP_MSK                   (0x1   << 1  )
#define TSTA_CAP                       (0x1   << 1  )
#define TSTA_CAP_CLR                   (0x0   << 1  ) /* CLR. No capture event is pending */
#define TSTA_CAP_SET                   (0x1   << 1  ) /* SET. A capture event is pending */

/* TSTA[TMOUT] - Timeout event occurred */
#define TSTA_TMOUT_MSK                 (0x1   << 0  )
#define TSTA_TMOUT                     (0x1   << 0  )
#define TSTA_TMOUT_CLR                 (0x0   << 0  ) /* CLR. No timeout event has occurred */
#define TSTA_TMOUT_SET                 (0x1   << 0  ) /* SET. A timeout event has occurred */


// -----------------------------------------------------------------------------
// -----                             TIMER                                 -----
// -----------------------------------------------------------------------------

/**
  * @brief TIMER (MMR_TIMER)
  */

typedef struct MMR_TIMER {                  /*!< MMR_TIMER Structure                   */
  __IO uint16_t  TLD;                       /*!< 16-bit load value register            */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  TVAL;                      /*!< 16-bit timer value register           */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  TCON;                      /*!< Control register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  TCLRI;                     /*!< Clear interrupt register              */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  TCAP;                      /*!< Capture register                      */
  __I  uint16_t  RESERVED4[5];
  __IO uint16_t  TSTA;                      /*!< Status register                       */
} MMR_TIMER_t;

/* Reset Value for T0LD*/
#define T0LD_RVAL                      0x0 

/* T0LD[LOAD] - Load value */
#define T0LD_LOAD_MSK                  (0xFFFF << 0  )

/* Reset Value for T0VAL*/
#define T0VAL_RVAL                     0x0 

/* T0VAL[VAL] - Current count */
#define T0VAL_VAL_MSK                  (0xFFFF << 0  )

/* Reset Value for T0CON*/
#define T0CON_RVAL                     0xA 

/* T0CON[EVENTEN] - Event select */
#define T0CON_EVENTEN_BBA              (*(volatile unsigned long *) 0x42000130)
#define T0CON_EVENTEN_MSK              (0x1   << 12 )
#define T0CON_EVENTEN                  (0x1   << 12 )
#define T0CON_EVENTEN_DIS              (0x0   << 12 ) /* Events will not be captured */
#define T0CON_EVENTEN_EN               (0x1   << 12 ) /* Events will be captured  */

/* T0CON[EVENT] - Event select range */
#define T0CON_EVENT_MSK                (0xF   << 8  )

/* T0CON[RLD] - Reload control */
#define T0CON_RLD_BBA                  (*(volatile unsigned long *) 0x4200011C)
#define T0CON_RLD_MSK                  (0x1   << 7  )
#define T0CON_RLD                      (0x1   << 7  )
#define T0CON_RLD_EN                   (0x1   << 7  ) /* Resets the up/down counter when TCLRI[0] is set */
#define T0CON_RLD_DIS                  (0x0   << 7  ) /* Up/Down counter is only reset on a timeout event */

/* T0CON[CLK] - Clock select */
#define T0CON_CLK_MSK                  (0x3   << 5  )
#define T0CON_CLK_PCLK                 (0x0   << 5  ) /* PCLK.                    */
#define T0CON_CLK_HCLK                 (0x1   << 5  ) /* HCLK.                    */
#define T0CON_CLK_LFOSC                (0x2   << 5  ) /* LFOSC. 32 KHz OSC        */
#define T0CON_CLK_HFXTAL               (0x3   << 5  ) /* HFXTAL. 16 MHz OSC or XTAL (Dependent on CLKCON0.11) */

/* T0CON[ENABLE] - Timer enable */
#define T0CON_ENABLE_BBA               (*(volatile unsigned long *) 0x42000110)
#define T0CON_ENABLE_MSK               (0x1   << 4  )
#define T0CON_ENABLE                   (0x1   << 4  )
#define T0CON_ENABLE_DIS               (0x0   << 4  ) /* DIS. Timer is disabled (default) */
#define T0CON_ENABLE_EN                (0x1   << 4  ) /* EN. Timer is enabled     */

/* T0CON[MOD] - Timer mode */
#define T0CON_MOD_BBA                  (*(volatile unsigned long *) 0x4200010C)
#define T0CON_MOD_MSK                  (0x1   << 3  )
#define T0CON_MOD                      (0x1   << 3  )
#define T0CON_MOD_FREERUN              (0x0   << 3  ) /* FREERUN.Timer runs in free running mode */
#define T0CON_MOD_PERIODIC             (0x1   << 3  ) /* PERIODIC. Timer runs in periodic mode (default) */

/* T0CON[UP] - Count up */
#define T0CON_UP_BBA                   (*(volatile unsigned long *) 0x42000108)
#define T0CON_UP_MSK                   (0x1   << 2  )
#define T0CON_UP                       (0x1   << 2  )
#define T0CON_UP_DIS                   (0x0   << 2  ) /* DIS. Timer is set to count down (default) */
#define T0CON_UP_EN                    (0x1   << 2  ) /* EN. Timer is set to count up */

/* T0CON[PRE] - Prescaler */
#define T0CON_PRE_MSK                  (0x3   << 0  )
#define T0CON_PRE_DIV1                 (0x0   << 0  ) /* source_clock / [1 or 4]  */
#define T0CON_PRE_DIV16                (0x1   << 0  ) /* source_clock / 16        */
#define T0CON_PRE_DIV256               (0x2   << 0  ) /* source_clock / 256       */
#define T0CON_PRE_DIV32768             (0x3   << 0  ) /* source_clock / 32,768    */

/* Reset Value for T0CLRI*/
#define T0CLRI_RVAL                    0x0 

