koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* Reset Value for T2STA*/
#define T2STA_RVAL                     0x0 

/* T2STA[PDOK] - TCLRI synchronization */
#define T2STA_PDOK_BBA                 (*(volatile unsigned long *) 0x4201039C)
#define T2STA_PDOK_MSK                 (0x1   << 7  )
#define T2STA_PDOK                     (0x1   << 7  )
#define T2STA_PDOK_CLR                 (0x0   << 7  ) /* CLR. The interrupt is cleared in the timer clock domain */
#define T2STA_PDOK_SET                 (0x1   << 7  ) /* SET. TCLRI[0] is being updated in the timer clock domain */

/* T2STA[BUSY] - Timer Busy */
#define T2STA_BUSY_BBA                 (*(volatile unsigned long *) 0x42010398)
#define T2STA_BUSY_MSK                 (0x1   << 6  )
#define T2STA_BUSY                     (0x1   << 6  )
#define T2STA_BUSY_CLR                 (0x0   << 6  ) /* CLR. Timer ready to receive commands to TCON */
#define T2STA_BUSY_SET                 (0x1   << 6  ) /* SET. Timer not ready to receive commands to TCON */

/* T2STA[CAP] - Capture event pending */
#define T2STA_CAP_BBA                  (*(volatile unsigned long *) 0x42010384)
#define T2STA_CAP_MSK                  (0x1   << 1  )
#define T2STA_CAP                      (0x1   << 1  )
#define T2STA_CAP_CLR                  (0x0   << 1  ) /* CLR. No capture event is pending */
#define T2STA_CAP_SET                  (0x1   << 1  ) /* SET. A capture event is pending */

/* T2STA[TMOUT] - Timeout event occurred */
#define T2STA_TMOUT_BBA                (*(volatile unsigned long *) 0x42010380)
#define T2STA_TMOUT_MSK                (0x1   << 0  )
#define T2STA_TMOUT                    (0x1   << 0  )
#define T2STA_TMOUT_CLR                (0x0   << 0  ) /* CLR. No timeout event has occurred */
#define T2STA_TMOUT_SET                (0x1   << 0  ) /* SET. A timeout event has occurred */
// ------------------------------------------------------------------------------------------------
// -----                                        ID                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief misc16 (MMR_ID)
  */

typedef struct MMR_ID {                     /*!< MMR_ID Structure                      */
  __IO uint16_t  CHIPID;                    /*!< Digital die ID                        */
} MMR_ID_t;

/* Reset Value for CHIPID*/
#define CHIPID_RVAL                    0x561 

/* CHIPID[PARTID] - Part Identifier */
#define CHIPID_PARTID_MSK              (0xFFF << 4  )

/* CHIPID[REV] - Silicon Revision Number */
#define CHIPID_REV_MSK                 (0xF   << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        PWRCTL                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief always_on (MMR_PWRCTL)
  */

typedef struct MMR_PWRCTL {                 /*!< MMR_PWRCTL Structure                  */
  __IO uint16_t  PWRMOD;                    /*!< Power modes                           */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  PWRKEY;                    /*!< Key protection for PWRMOD             */
} MMR_PWRCTL_t;

/* Reset Value for PWRMOD*/
#define PWRMOD_RVAL                    0x0 

/* PWRMOD[WICENACK] - WIC Acknowledgment for SLEEPDEEP */
#define PWRMOD_WICENACK_BBA            (*(volatile unsigned long *) 0x4204800C)
#define PWRMOD_WICENACK_MSK            (0x1   << 3  )
#define PWRMOD_WICENACK                (0x1   << 3  )
#define PWRMOD_WICENACK_DIS            (0x0   << 3  )
#define PWRMOD_WICENACK_EN             (0x1   << 3  )

/* PWRMOD[PWRMOD] - Power modes control bits */
#define PWRMOD_PWRMOD_MSK              (0x3   << 0  )
#define PWRMOD_PWRMOD_FULLACTIVE       (0x0   << 0  ) /* Active Mode              */
#define PWRMOD_PWRMOD_CORESLEEP        (0x1   << 0  ) /* CORE_SLEEP Mode          */
#define PWRMOD_PWRMOD_SYSSLEEP         (0x2   << 0  ) /* SYS_SLEEP Mode           */
#define PWRMOD_PWRMOD_HIBERNATE        (0x3   << 0  ) /* Hibernate Mode           */

/* Reset Value for PWRKEY*/
#define PWRKEY_RVAL                    0x0 

/* PWRKEY[PWRKEY] - Power control key register */
#define PWRKEY_PWRKEY_MSK              (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        RESET                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief always_on (MMR_RESET)
  */

typedef struct MMR_RESET {                  /*!< MMR_RESET Structure                   */
  __IO uint16_t  RSTCFG;                    /*!< Reset configuration                   */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  RSTKEY;                    /*!< Key protection for RSTCFG             */
  __I  uint16_t  RESERVED1[25];
  __IO uint16_t  RSTSTA;                    /*!< Reset status                          */
} MMR_RESET_t;

/* Reset Value for RSTCFG*/
#define RSTCFG_RVAL                    0x0 

/* RSTCFG[GPIO_PLA_RETAIN] - GPIO/PLA retain their status after WDT and software reset */
#define RSTCFG_GPIO_PLA_RETAIN_BBA     (*(volatile unsigned long *) 0x42048100)
#define RSTCFG_GPIO_PLA_RETAIN_MSK     (0x1   << 0  )
#define RSTCFG_GPIO_PLA_RETAIN         (0x1   << 0  )
#define RSTCFG_GPIO_PLA_RETAIN_DIS     (0x1   << 0  ) /* GPIO/PLA don't retain status after watchdog or software reset. */
#define RSTCFG_GPIO_PLA_RETAIN_EN      (0x0   << 0  ) /* GPIO/PLA retain status after watchdog or software reset */

/* Reset Value for RSTKEY*/
#define RSTKEY_RVAL                    0x0 

/* RSTKEY[RSTKEY] - Reset configuration key register */
#define RSTKEY_RSTKEY_MSK              (0xFFFF << 0  )

/* Reset Value for RSTSTA*/
#define RSTSTA_RVAL                    0x0 

/* RSTSTA[SWRST] - Software reset */
#define RSTSTA_SWRST_BBA               (*(volatile unsigned long *) 0x4204880C)
#define RSTSTA_SWRST_MSK               (0x1   << 3  )
#define RSTSTA_SWRST                   (0x1   << 3  )
#define RSTSTA_SWRST_DIS               (0x0   << 3  )
#define RSTSTA_SWRST_EN                (0x1   << 3  )

/* RSTSTA[WDRST] - Watchdog timeout */
#define RSTSTA_WDRST_BBA               (*(volatile unsigned long *) 0x42048808)
#define RSTSTA_WDRST_MSK               (0x1   << 2  )
#define RSTSTA_WDRST                   (0x1   << 2  )
#define RSTSTA_WDRST_DIS               (0x0   << 2  )
#define RSTSTA_WDRST_EN                (0x1   << 2  )

