koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* RSTSTA[EXTRST] - External reset */
#define RSTSTA_EXTRST_BBA              (*(volatile unsigned long *) 0x42048804)
#define RSTSTA_EXTRST_MSK              (0x1   << 1  )
#define RSTSTA_EXTRST                  (0x1   << 1  )
#define RSTSTA_EXTRST_DIS              (0x0   << 1  )
#define RSTSTA_EXTRST_EN               (0x1   << 1  )

/* RSTSTA[POR] - Power-on reset */
#define RSTSTA_POR_BBA                 (*(volatile unsigned long *) 0x42048800)
#define RSTSTA_POR_MSK                 (0x1   << 0  )
#define RSTSTA_POR                     (0x1   << 0  )
#define RSTSTA_POR_DIS                 (0x0   << 0  )
#define RSTSTA_POR_EN                  (0x1   << 0  )


/* ========================================================================== */
/* ================           EXTERNAL INTERRUPTS          ================== */
/* ========================================================================== */

/**
  * @brief EXTI (MMR_EXTI)
  */

typedef struct MMR_EXTI {             /*!< MMR_EXTI Structure                 */
  __IOM uint16_t  EI0CFG;             /*!< External Interrupt configuration 0 */
  __IM  uint16_t  RESERVED0;
  __IOM uint16_t  EI1CFG;             /*!< External Interrupt configuration 1 */
  __IM  uint16_t  RESERVED1;
  __IOM uint16_t  EI2CFG;             /*!< External Interrupt configuration 2 */
  __IM  uint16_t  RESERVED2[3];
  __IOM uint16_t  EICLR;              /*!< External Interrupt clear           */
  __IM  uint16_t  RESERVED3;
} MMR_EXTI_t;

/* EI0CFG[IRQ2EN] - External Interrupt 2 Enable bit */
#define EI0CFG_IRQ2EN_Pos             (11U)
#define EI0CFG_IRQ2EN_Msk             (0x1U << EI0CFG_IRQ2EN_Pos)
#define EI0CFG_IRQ2EN_DIS             (0x0U << EI0CFG_IRQ2EN_Pos)               /* External Interrupt 2 disabled */
#define EI0CFG_IRQ2EN_EN              (0x1U << EI0CFG_IRQ2EN_Pos)               /* External Interrupt 2 enabled  */

/* EI0CFG[IRQ2MDE] - External Interrupt 2 Mode registers */
#define EI0CFG_IRQ2MDE_Pos            (8U)
#define EI0CFG_IRQ2MDE_Msk            (0x7U << EI0CFG_IRQ2MDE_Pos)
#define EI0CFG_IRQ2MDE_RISE           (0x0U << EI0CFG_IRQ2MDE_Pos)              /* Rising edge              */
#define EI0CFG_IRQ2MDE_FALL           (0x1U << EI0CFG_IRQ2MDE_Pos)              /* Falling edge             */
#define EI0CFG_IRQ2MDE_RISEORFALL     (0x2U << EI0CFG_IRQ2MDE_Pos)              /* Rising or falling edge   */
#define EI0CFG_IRQ2MDE_HIGHLEVEL      (0x3U << EI0CFG_IRQ2MDE_Pos)              /* High level               */
#define EI0CFG_IRQ2MDE_LOWLEVEL       (0x4U << EI0CFG_IRQ2MDE_Pos)              /* Low level                */

/* EI0CFG[IRQ1EN] - External Interrupt 1 Enable bit */
#define EI0CFG_IRQ1EN_Pos             (7U)
#define EI0CFG_IRQ1EN_Msk             (0x1U << EI0CFG_IRQ1EN_Pos)
#define EI0CFG_IRQ1EN_DIS             (0x0U << EI0CFG_IRQ1EN_Pos)               /* External Interrupt 1 disabled */
#define EI0CFG_IRQ1EN_EN              (0x1U << EI0CFG_IRQ1EN_Pos)               /* External Interrupt 1 enabled  */

/* EI0CFG[IRQ1MDE] - External Interrupt 1 Mode registers */
#define EI0CFG_IRQ1MDE_Pos            (4U)
#define EI0CFG_IRQ1MDE_Msk            (0x7U << EI0CFG_IRQ1MDE_Pos)
#define EI0CFG_IRQ1MDE_RISE           (0x0U << EI0CFG_IRQ1MDE_Pos)              /* Rising edge              */
#define EI0CFG_IRQ1MDE_FALL           (0x1U << EI0CFG_IRQ1MDE_Pos)              /* Falling edge             */
#define EI0CFG_IRQ1MDE_RISEORFALL     (0x2U << EI0CFG_IRQ1MDE_Pos)              /* Rising or falling edge   */
#define EI0CFG_IRQ1MDE_HIGHLEVEL      (0x3U << EI0CFG_IRQ1MDE_Pos)              /* High level               */
#define EI0CFG_IRQ1MDE_LOWLEVEL       (0x4U << EI0CFG_IRQ1MDE_Pos)              /* Low level                */

/* EI0CFG[IRQ0EN] - External Interrupt 0 Enable bit */
#define EI0CFG_IRQ0EN_Pos             (3U)
#define EI0CFG_IRQ0EN_Msk             (0x1U << EI0CFG_IRQ0EN_Pos)
#define EI0CFG_IRQ0EN_DIS             (0x0U << EI0CFG_IRQ0EN_Pos)               /* External Interrupt 0 disabled */
#define EI0CFG_IRQ0EN_EN              (0x1U << EI0CFG_IRQ0EN_Pos)               /* External Interrupt 0 enabled  */

/* EI0CFG[IRQ0MDE] - External Interrupt 0 Mode registers */
#define EI0CFG_IRQ0MDE_Pos            (0U)
#define EI0CFG_IRQ0MDE_Msk            (0x7U << EI0CFG_IRQ0MDE_Pos)
#define EI0CFG_IRQ0MDE_RISE           (0x0U << EI0CFG_IRQ0MDE_Pos)              /* Rising edge              */
#define EI0CFG_IRQ0MDE_FALL           (0x1U << EI0CFG_IRQ0MDE_Pos)              /* Falling edge             */
#define EI0CFG_IRQ0MDE_RISEORFALL     (0x2U << EI0CFG_IRQ0MDE_Pos)              /* Rising or falling edge   */
#define EI0CFG_IRQ0MDE_HIGHLEVEL      (0x3U << EI0CFG_IRQ0MDE_Pos)              /* High level               */
#define EI0CFG_IRQ0MDE_LOWLEVEL       (0x4U << EI0CFG_IRQ0MDE_Pos)              /* Low level                */

/* EI1CFG[IRQ7EN] - External Interrupt 7 Enable bit */
#define EI1CFG_IRQ7EN_Pos             (15U)
#define EI1CFG_IRQ7EN_Msk             (0x1U << EI1CFG_IRQ7EN_Pos)
#define EI1CFG_IRQ7EN_DIS             (0x0U << EI1CFG_IRQ7EN_Pos)               /* External Interrupt 7 disabled */
#define EI1CFG_IRQ7EN_EN              (0x1U << EI1CFG_IRQ7EN_Pos)               /* External Interrupt 7 enabled  */

/* EI1CFG[IRQ7MDE] - External Interrupt 7 Mode registers */
#define EI1CFG_IRQ7MDE_Pos            (12U)
#define EI1CFG_IRQ7MDE_Msk            (0x7U << EI1CFG_IRQ7MDE_Pos)
#define EI1CFG_IRQ7MDE_RISE           (0x0U << EI1CFG_IRQ7MDE_Pos)              /* Rising edge              */
#define EI1CFG_IRQ7MDE_FALL           (0x1U << EI1CFG_IRQ7MDE_Pos)              /* Falling edge             */
#define EI1CFG_IRQ7MDE_RISEORFALL     (0x2U << EI1CFG_IRQ7MDE_Pos)              /* Rising or falling edge   */
#define EI1CFG_IRQ7MDE_HIGHLEVEL      (0x3U << EI1CFG_IRQ7MDE_Pos)              /* High level               */
#define EI1CFG_IRQ7MDE_LOWLEVEL       (0x4U << EI1CFG_IRQ7MDE_Pos)              /* Low level                */

/* EI1CFG[IRQ5EN] - External Interrupt 5 Enable bit */
#define EI1CFG_IRQ5EN_Pos             (7U)
#define EI1CFG_IRQ5EN_Msk             (0x1U << EI1CFG_IRQ5EN_Pos)
#define EI1CFG_IRQ5EN_DIS             (0x0U << EI1CFG_IRQ5EN_Pos)               /* External Interrupt 5 disabled */
#define EI1CFG_IRQ5EN_EN              (0x1U << EI1CFG_IRQ5EN_Pos)               /* External Interrupt 5 enabled  */

/* EI1CFG[IRQ5MDE] - External Interrupt 5 Mode registers */
#define EI1CFG_IRQ5MDE_Pos            (4U)
#define EI1CFG_IRQ5MDE_Msk            (0x7U << EI1CFG_IRQ5MDE_Pos)
#define EI1CFG_IRQ5MDE_RISE           (0x0U << EI1CFG_IRQ5MDE_Pos)              /* Rising edge              */
#define EI1CFG_IRQ5MDE_FALL           (0x1U << EI1CFG_IRQ5MDE_Pos)              /* Falling edge             */
#define EI1CFG_IRQ5MDE_RISEORFALL     (0x2U << EI1CFG_IRQ5MDE_Pos)              /* Rising or falling edge   */
#define EI1CFG_IRQ5MDE_HIGHLEVEL      (0x3U << EI1CFG_IRQ5MDE_Pos)              /* High level               */
#define EI1CFG_IRQ5MDE_LOWLEVEL       (0x4U << EI1CFG_IRQ5MDE_Pos)              /* Low level                */

/* EI1CFG[IRQ4EN] - External Interrupt 4 Enable bit */
#define EI1CFG_IRQ4EN_Pos             (3U)
#define EI1CFG_IRQ4EN_Msk             (0x1U << EI1CFG_IRQ4EN_Pos)
#define EI1CFG_IRQ4EN_DIS             (0x0U << EI1CFG_IRQ4EN_Pos)               /* External Interrupt 4 disabled */
#define EI1CFG_IRQ4EN_EN              (0x1U << EI1CFG_IRQ4EN_Pos)               /* External Interrupt 4 enabled  */

/* EI1CFG[IRQ4MDE] - External Interrupt 4 Mode registers */
#define EI1CFG_IRQ4MDE_Pos            (0U)
#define EI1CFG_IRQ4MDE_Msk            (0x7U << EI1CFG_IRQ4MDE_Pos)
#define EI1CFG_IRQ4MDE_RISE           (0x0U << EI1CFG_IRQ4MDE_Pos)              /* Rising edge              */
#define EI1CFG_IRQ4MDE_FALL           (0x1U << EI1CFG_IRQ4MDE_Pos)              /* Falling edge             */
#define EI1CFG_IRQ4MDE_RISEORFALL     (0x2U << EI1CFG_IRQ4MDE_Pos)              /* Rising or falling edge   */
#define EI1CFG_IRQ4MDE_HIGHLEVEL      (0x3U << EI1CFG_IRQ4MDE_Pos)              /* High level               */
#define EI1CFG_IRQ4MDE_LOWLEVEL       (0x4U << EI1CFG_IRQ4MDE_Pos)              /* Low level                */

/* EI2CFG[IRQ8EN] - External Interrupt 8 Enable bit */
#define EI2CFG_IRQ8EN_Pos             (3U)
#define EI2CFG_IRQ8EN_Msk             (0x1U << EI2CFG_IRQ8EN_Pos)
#define EI2CFG_IRQ8EN_DIS             (0x0U << EI2CFG_IRQ8EN_Pos)               /* External Interrupt 8 disabled */
#define EI2CFG_IRQ8EN_EN              (0x1U << EI2CFG_IRQ8EN_Pos)               /* External Interrupt 8 enabled  */

/* EI2CFG[IRQ8MDE] - External Interrupt 8 Mode registers */
#define EI2CFG_IRQ8MDE_Pos            (0U)
#define EI2CFG_IRQ8MDE_Msk            (0x7U << EI2CFG_IRQ8MDE_Pos)
#define EI2CFG_IRQ8MDE_RISE           (0x0U << EI2CFG_IRQ8MDE_Pos)              /* Rising edge              */
#define EI2CFG_IRQ8MDE_FALL           (0x1U << EI2CFG_IRQ8MDE_Pos)              /* Falling edge             */
#define EI2CFG_IRQ8MDE_RISEORFALL     (0x2U << EI2CFG_IRQ8MDE_Pos)              /* Rising or falling edge   */
#define EI2CFG_IRQ8MDE_HIGHLEVEL      (0x3U << EI2CFG_IRQ8MDE_Pos)              /* High level               */
#define EI2CFG_IRQ8MDE_LOWLEVEL       (0x4U << EI2CFG_IRQ8MDE_Pos)              /* Low level                */

/* EICLR[IRQ8] - External interrupt 8 */
#define EICLR_IRQ8_Pos                (8U)
#define EICLR_IRQ8_Msk                (0x1U << EICLR_IRQ8_Pos)
#define EICLR_IRQ8_CLR                EICLR_IRQ8_Msk

