koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* EICLR[IRQ7] - External interrupt 7 */
#define EICLR_IRQ7_Pos                (7U)
#define EICLR_IRQ7_Msk                (0x1U << EICLR_IRQ7_Pos)
#define EICLR_IRQ7_CLR                EICLR_IRQ7_Msk

/* EICLR[IRQ5] - External interrupt 5 */
#define EICLR_IRQ5_Pos                (5U)
#define EICLR_IRQ5_Msk                (0x1U << EICLR_IRQ5_Pos)
#define EICLR_IRQ5_CLR                EICLR_IRQ5_Msk

/* EICLR[IRQ4] - External interrupt 4 */
#define EICLR_IRQ4_Pos                (4U)
#define EICLR_IRQ4_Msk                (0x1U << EICLR_IRQ4_Pos)
#define EICLR_IRQ4_CLR                EICLR_IRQ4_Msk

/* EICLR[IRQ2] - External interrupt 2 */
#define EICLR_IRQ2_Pos                (2U)
#define EICLR_IRQ2_Msk                (0x1U << EICLR_IRQ2_Pos)
#define EICLR_IRQ2_CLR                EICLR_IRQ2_Msk

/* EICLR[IRQ1] - External interrupt 1 */
#define EICLR_IRQ1_Pos                (1U)
#define EICLR_IRQ1_Msk                (0x1U << EICLR_IRQ1_Pos)
#define EICLR_IRQ1_CLR                EICLR_IRQ1_Msk

/* EICLR[IRQ0] - External interrupt 0 */
#define EICLR_IRQ0_Pos                (0U)
#define EICLR_IRQ0_Msk                (0x1U << EICLR_IRQ0_Pos)
#define EICLR_IRQ0_CLR                EICLR_IRQ0_Msk


/* ========================================================================== */
/* ================             WATCHDOG TIMER             ================== */
/* ========================================================================== */

/**
 * @brief WDT (MMR_WDT)
 */

typedef struct MMR_WDT {              /*!< MMR_WDT Structure                  */
  __IO uint16_t  T3LD;                /*!< Load value register                */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  T3VAL;               /*!< Current count value register       */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  T3CON;               /*!< Control register                   */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  T3CLRI;              /*!< Clear interrupt register           */
  __I  uint16_t  RESERVED3[5];
  __IO uint16_t  T3STA;               /*!< Status register                    */
  __I  uint16_t  RESERVED4;
} MMR_WDT_t;

/* T3LD[LOAD] - Load value */
#define T3LD_LOAD_Pos                 (0U)
#define T3LD_LOAD_Msk                 (0xFFFFU << T3LD_LOAD_Pos)

/* T3VAL[CCOUNT] - Current count value */
#define T3VAL_CCOUNT_Pos              (0U)
#define T3VAL_CCOUNT_Msk              (0xFFFFU << T3VAL_CCOUNT_Pos)

/* T3CON[MOD] - Timer mode */
#define T3CON_MOD_Pos                 (6U)
#define T3CON_MOD_Msk                 (0x1U << T3CON_MOD_Pos)
#define T3CON_MOD_FREERUN             (0x0U << T3CON_MOD_Pos)                   /* FREERUN. Cleared by user to operate in free running mode. */
#define T3CON_MOD_PERIODIC            (0x1U << T3CON_MOD_Pos)                   /* PERIODIC. Set by user to operate in periodic mode (default). */

/* T3CON[ENABLE] - Timer enable */
#define T3CON_ENABLE_Pos              (5U)
#define T3CON_ENABLE_MSK              (0x1U << T3CON_ENABLE_Pos)
#define T3CON_ENABLE                  T3CON_ENABLE_MSK

/* T3CON[PRE] - Prescaler */
#define T3CON_PRE_Pos                 (2U)
#define T3CON_PRE_Msk                 (0x3U << T3CON_PRE_Pos)
#define T3CON_PRE_DIV1                (0x0U << T3CON_PRE_Pos)                   /* DIV1.Source clock/1.     */
#define T3CON_PRE_DIV16               (0x1U << T3CON_PRE_Pos)                   /* DIV16. Source clock/16.  */
#define T3CON_PRE_DIV256              (0x2U << T3CON_PRE_Pos)                   /* DIV256. Source clock/256 (default). */
#define T3CON_PRE_DIV4096             (0x3U << T3CON_PRE_Pos)                   /* DIV4096. Source clock/4096 */

/* T3CON[IRQ] - Timer interrupt */
#define T3CON_IRQ_Pos                 (1U)
#define T3CON_IRQ_Msk                 (0x1U << T3CON_IRQ_Pos)
#define T3CON_IRQ_DIS                 (0x0U << T3CON_IRQ_Pos)                   /* DIS.Cleared by user to generate a reset on a time out (default). */
#define T3CON_IRQ_EN                  (0x1U << T3CON_IRQ_Pos)                   /* EN.Set by user to generate an interrupt when the timer times out. This feature is provided for debug purposes and is only available in ACTIVE mode. */

/* T3CON[PMD] - Power Mode Disable */
#define T3CON_PMD_Pos                 (0U)
#define T3CON_PMD_Msk                 (0x1U << T3CON_PMD_Pos)
#define T3CON_PMD_DIS                 (0x0U << T3CON_PMD_Pos)                   /* DIS. The watchdog timer will continue its count down while in hibernate mode. */
#define T3CON_PMD_EN                  (0x1U << T3CON_PMD_Pos)                   /* EN. When hibernate mode is entered, the watchdog counter will suspend its count down. As hibernate mode is exited, the count down will resume from its current count value (the count will not be reset). */

/* T3CLRI[CLRWDG] - Clear watchdog */
#define T3CLRI_CLRWDG_Pos             (0U)
#define T3CLRI_CLRWDG_Msk             (0xFFFFU << T3CLRI_CLRWDG_Pos)
#define T3CLRI_CLRWDG_VALUE           (uint16_t)(0xCCCCU << T3CLRI_CLRWDG_Pos)

/* T3STA[LOCK] - Lock status bit */
#define T3STA_LOCK_Pos                (4U)
#define T3STA_LOCK_Msk                (0x1U << T3STA_LOCK_Pos)
#define T3STA_LOCK_CLR                (0x0U << T3STA_LOCK_Pos)
#define T3STA_LOCK_SET                (0x1U << T3STA_LOCK_Pos)

/* T3STA[CON] - T3CON write sync in progress */
#define T3STA_CON_Pos                 (3U)
#define T3STA_CON_Msk                 (0x1U << T3STA_CON_Pos)
#define T3STA_CON_CLR                 (0x0U << T3STA_CON_Pos)                   /* APB and T3 clock domains T3CON configuration values match */
#define T3STA_CON_SET                 (0x1U << T3STA_CON_Pos)                   /* APB T3CON register values are being synchronized to T3 clock domain */

/* T3STA[LD] - T3LD write sync in progress */
#define T3STA_LD_Pos                  (2U)
#define T3STA_LD_Msk                  (0x1U << T3STA_LD_Pos)
#define T3STA_LD_CLR                  (0x0U << T3STA_LD_Pos)                    /* APB and T3 clock domains T3LD values match */
#define T3STA_LD_SET                  (0x1U << T3STA_LD_Pos)                    /* APB T3LD value is being synchronized to T3 clock domain */

/* T3STA[CLRI] - T3CLRI write sync in progress */
#define T3STA_CLRI_Pos                (1U)
#define T3STA_CLRI_Msk                (0x1U << T3STA_CLRI_Pos)
#define T3STA_CLRI_CLR                (0x0U << T3STA_CLRI_Pos)                  /* APB T3CLRI write sync not done */
#define T3STA_CLRI_SET                (0x1U << T3STA_CLRI_Pos)                  /* APB T3CLRI write is being synced to T3 clock domain. T3 will be restarted (if 0xCCCC was written) once sync is complete */

/* T3STA[IRQ] - Watchdog timer interrupt */
#define T3STA_IRQ_Pos                 (0U)
#define T3STA_IRQ_Msk                 (0x1U << T3STA_IRQ_Pos)
#define T3STA_IRQ_CLR                 (0x0U << T3STA_IRQ_Pos)                   /* Timer 3 interrupt not pending */
#define T3STA_IRQ_SET                 (0x1U << T3STA_IRQ_Pos)                   /* Timer 3 interrupt pending */


// ------------------------------------------------------------------------------------------------
// -----                                        wut                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief wut (MMR_WUT)
  */

typedef struct MMR_WUT {                    /*!< MMR_WUT Structure                     */
  __IO uint16_t  T4VAL0;                    /*!< Current count value - LS 16 bits      */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  T4VAL1;                    /*!< Current count value - MS 16 bits      */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  T4CON;                     /*!< Control register                      */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  T4INC;                     /*!< 12-bit interval for wakeup field A    */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  T4WUFB0;                   /*!< Wakeup field B - LS 16 bits           */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  T4WUFB1;                   /*!< Wakeup field B - MS 16 bits           */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  T4WUFC0;                   /*!< Wakeup field C - LS 16 bits           */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  T4WUFC1;                   /*!< Wakeup field C - MS 16 bits           */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  T4WUFD0;                   /*!< Wakeup field D - LS 16 bits           */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  T4WUFD1;                   /*!< Wakeup field D - MS 16 bits           */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  T4IEN;                     /*!< Interrupt enable register             */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  T4STA;                     /*!< Status register                       */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  T4CLRI;                    /*!< Clear interrupt register              */
  __I  uint16_t  RESERVED12[5];
  __IO uint16_t  T4WUFA0;                   /*!< Wakeup field A - LS 16 bits           */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  T4WUFA1;                   /*!< Wakeup field A - MS 16 bits           */
} MMR_WUT_t;

