koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* T4STA[IRQCRY] - Wakeup status to powerdown */
#define T4STA_IRQCRY_BBA               (*(volatile unsigned long *) 0x4204A598)
#define T4STA_IRQCRY_MSK               (0x1   << 6  )
#define T4STA_IRQCRY                   (0x1   << 6  )
#define T4STA_IRQCRY_CLR               (0x0   << 6  )
#define T4STA_IRQCRY_SET               (0x1   << 6  )

/* T4STA[ROLL] - Rollover interrupt flag */
#define T4STA_ROLL_BBA                 (*(volatile unsigned long *) 0x4204A590)
#define T4STA_ROLL_MSK                 (0x1   << 4  )
#define T4STA_ROLL                     (0x1   << 4  )
#define T4STA_ROLL_CLR                 (0x0   << 4  )
#define T4STA_ROLL_SET                 (0x1   << 4  )

/* T4STA[WUFD] - T4WUFD interrupt flag */
#define T4STA_WUFD_BBA                 (*(volatile unsigned long *) 0x4204A58C)
#define T4STA_WUFD_MSK                 (0x1   << 3  )
#define T4STA_WUFD                     (0x1   << 3  )
#define T4STA_WUFD_CLR                 (0x0   << 3  )
#define T4STA_WUFD_SET                 (0x1   << 3  )

/* T4STA[WUFC] - T4WUFC interrupt flag */
#define T4STA_WUFC_BBA                 (*(volatile unsigned long *) 0x4204A588)
#define T4STA_WUFC_MSK                 (0x1   << 2  )
#define T4STA_WUFC                     (0x1   << 2  )
#define T4STA_WUFC_CLR                 (0x0   << 2  )
#define T4STA_WUFC_SET                 (0x1   << 2  )

/* T4STA[WUFB] - T4WUFB interrupt flag */
#define T4STA_WUFB_BBA                 (*(volatile unsigned long *) 0x4204A584)
#define T4STA_WUFB_MSK                 (0x1   << 1  )
#define T4STA_WUFB                     (0x1   << 1  )
#define T4STA_WUFB_CLR                 (0x0   << 1  )
#define T4STA_WUFB_SET                 (0x1   << 1  )

/* T4STA[WUFA] - T4WUFA interrupt flag */
#define T4STA_WUFA_BBA                 (*(volatile unsigned long *) 0x4204A580)
#define T4STA_WUFA_MSK                 (0x1   << 0  )
#define T4STA_WUFA                     (0x1   << 0  )
#define T4STA_WUFA_CLR                 (0x0   << 0  )
#define T4STA_WUFA_SET                 (0x1   << 0  )

/* Reset Value for T4CLRI*/
#define T4CLRI_RVAL                    0x0 

/* T4CLRI[ROLL] - Rollover interrupt clear */
#define T4CLRI_ROLL_BBA                (*(volatile unsigned long *) 0x4204A610)
#define T4CLRI_ROLL_MSK                (0x1   << 4  )
#define T4CLRI_ROLL                    (0x1   << 4  )
#define T4CLRI_ROLL_DIS                (0x0   << 4  )
#define T4CLRI_ROLL_EN                 (0x1   << 4  )

/* T4CLRI[WUFD] - T4WUFD interrupt clear */
#define T4CLRI_WUFD_BBA                (*(volatile unsigned long *) 0x4204A60C)
#define T4CLRI_WUFD_MSK                (0x1   << 3  )
#define T4CLRI_WUFD                    (0x1   << 3  )
#define T4CLRI_WUFD_DIS                (0x0   << 3  )
#define T4CLRI_WUFD_EN                 (0x1   << 3  )

/* T4CLRI[WUFC] - T4WUFC interrupt clear */
#define T4CLRI_WUFC_BBA                (*(volatile unsigned long *) 0x4204A608)
#define T4CLRI_WUFC_MSK                (0x1   << 2  )
#define T4CLRI_WUFC                    (0x1   << 2  )
#define T4CLRI_WUFC_DIS                (0x0   << 2  )
#define T4CLRI_WUFC_EN                 (0x1   << 2  )

/* T4CLRI[WUFB] - T4WUFB interrupt clear */
#define T4CLRI_WUFB_BBA                (*(volatile unsigned long *) 0x4204A604)
#define T4CLRI_WUFB_MSK                (0x1   << 1  )
#define T4CLRI_WUFB                    (0x1   << 1  )
#define T4CLRI_WUFB_DIS                (0x0   << 1  )
#define T4CLRI_WUFB_EN                 (0x1   << 1  )

/* T4CLRI[WUFA] - T4WUFA interrupt clear */
#define T4CLRI_WUFA_BBA                (*(volatile unsigned long *) 0x4204A600)
#define T4CLRI_WUFA_MSK                (0x1   << 0  )
#define T4CLRI_WUFA                    (0x1   << 0  )
#define T4CLRI_WUFA_DIS                (0x0   << 0  )
#define T4CLRI_WUFA_EN                 (0x1   << 0  )

/* Reset Value for T4WUFA0*/
#define T4WUFA0_RVAL                   0x1900 

/* T4WUFA0[T4WUFAL] - Wakeup field A Low */
#define T4WUFA0_T4WUFAL_MSK            (0xFFFF << 0  )

/* Reset Value for T4WUFA1*/
#define T4WUFA1_RVAL                   0x0 

/* T4WUFA1[T4WUFAH] - Wakeup field A High */
#define T4WUFA1_T4WUFAH_MSK            (0xFFFF << 0  )


/* ========================================================================== */
/* ================                   I2C                  ================== */
/* ========================================================================== */

/**
  * @brief I2C (MMR_I2C0)
  */

typedef struct MMR_I2C {          /*!< MMR_I2C0 Structure                     */
  __IO uint16_t  I2CMCON;         /*!< Master control register                */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  I2CMSTA;         /*!< Master status register                 */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  I2CMRX;          /*!< Master receive data register           */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  I2CMTX;          /*!< Master transmit data register          */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  I2CMRXCNT;       /*!< Master receive data count register     */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  I2CMCRXCNT;      /*!< Master current receive data count register */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  I2CADR0;         /*!< 1st master address byte register       */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  I2CADR1;         /*!< 2nd master address byte register       */
  __I  uint16_t  RESERVED7[3];
  __IO uint16_t  I2CDIV;          /*!< Serial clock period divisor register   */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  I2CSCON;         /*!< Slave control register                 */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  I2CSSTA;         /*!< Slave I2C Status/Error/IRQ register    */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  I2CSRX;          /*!< Slave receive register                 */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  I2CSTX;          /*!< Slave transmit register                */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  I2CALT;          /*!< Hardware general call ID register      */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  I2CID0;          /*!< 1st slave address device ID register   */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  I2CID1;          /*!< 2nd slave address device ID register   */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  I2CID2;          /*!< 3rd slave address device ID register   */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  I2CID3;          /*!< 4th slave address device ID register   */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  I2CFSTA;         /*!< Master and slave FIFO status register  */
  __I  uint16_t  RESERVED18;
  __IO uint16_t  I2CSHCON;        /*!< Shared control register                */
  __I  uint16_t  RESERVED19[3];
#if defined(ADUCM320I) | defined(ADUCM322) | defined(ADUCM322I)
  __IO uint16_t  I2CASSCL;        /*!< Automatic Stretch control register     */
  __I  uint16_t  RESERVED20;
#endif
} MMR_I2C_t;

/* I2CMCON[PRESTOP_BUS_CLR] - Prestop Bus-Clear */
#define I2CMCON_PRESTOP_BUS_CLR_Pos    (13U)
#define I2CMCON_PRESTOP_BUS_CLR_Msk    (0x1U << I2CMCON_PRESTOP_BUS_CLR_Pos)
#define I2CMCON_PRESTOP_BUS_CLR                 I2CMCON_PRESTOP_BUS_CLR_Msk

/* I2CMCON[BUS_CLR_EN] - Bus-Clear Enable */
#define I2CMCON_BUS_CLR_EN_Pos         (12U)
#define I2CMCON_BUS_CLR_EN_Msk         (0x1U << I2CMCON_BUS_CLR_EN_Pos)
#define I2CMCON_BUS_CLR_EN                      I2CMCON_BUS_CLR_EN_Msk

/* I2CMCON[MTXDMA] - Enable master Tx DMA request */
#define I2CMCON_MTXDMA_Pos             (11U)
#define I2CMCON_MTXDMA_Msk             (0x1U << I2CMCON_MTXDMA_Pos)
#define I2CMCON_MTXDMA                          I2CMCON_MTXDMA_Msk

/* I2CMCON[MRXDMA] - Enable master Rx DMA request */
#define I2CMCON_MRXDMA_Pos             (10U)
#define I2CMCON_MRXDMA_Msk             (0x1U << I2CMCON_MRXDMA_Pos)
#define I2CMCON_MRXDMA                          I2CMCON_MRXDMA_Msk

