koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* I2CMCON[MXMITDEC] - Decrement master TX FIFO status when a byte has been transmitted */
#define I2CMCON_MXMITDEC_Pos           (9U)
#define I2CMCON_MXMITDEC_Msk           (0x1U << I2CMCON_MXMITDEC_Pos)
#define I2CMCON_MXMITDEC                        I2CMCON_MXMITDEC_Msk

/* I2CMCON[IENCMP] - Transaction completed (or stop detected) interrupt enable */
#define I2CMCON_IENCMP_Pos             (8U)
#define I2CMCON_IENCMP_Msk             (0x1U << I2CMCON_IENCMP_Pos)
#define I2CMCON_IENCMP                          I2CMCON_IENCMP_Msk

/* I2CMCON[IENACK] - ACK not received interrupt enable */
#define I2CMCON_IENACK_Pos             (7U)
#define I2CMCON_IENACK_Msk             (0x1U << I2CMCON_IENACK_Pos)
#define I2CMCON_IENACK                          I2CMCON_IENACK_Msk

/* I2CMCON[IENALOST] - Arbitration lost interrupt enable */
#define I2CMCON_IENALOST_Pos           (6U)
#define I2CMCON_IENALOST_Msk           (0x1U << I2CMCON_IENALOST_Pos)
#define I2CMCON_IENALOST                        I2CMCON_IENALOST_Msk

/* I2CMCON[IENMTX] - Transmit request interrupt enable */
#define I2CMCON_IENMTX_Pos             (5U)
#define I2CMCON_IENMTX_Msk             (0x1U << I2CMCON_IENMTX_Pos)
#define I2CMCON_IENMTX                          I2CMCON_IENMTX_Msk

/* I2CMCON[IENMRX] - Receive request interrupt enable */
#define I2CMCON_IENMRX_Pos             (4U)
#define I2CMCON_IENMRX_Msk             (0x1U << I2CMCON_IENMRX_Pos)
#define I2CMCON_IENMRX                          I2CMCON_IENMRX_Msk

/* I2CMCON[STRETCH] - Stretch SCL enable */
#define I2CMCON_STRETCH_Pos            (3U)
#define I2CMCON_STRETCH_Msk            (0x1U << I2CMCON_STRETCH_Pos)
#define I2CMCON_STRETCH                         I2CMCON_STRETCH_Msk

/* I2CMCON[LOOPBACK] - Internal loopback enable */
#define I2CMCON_LOOPBACK_Pos           (2U)
#define I2CMCON_LOOPBACK_Msk           (0x1U << I2CMCON_LOOPBACK_Pos)
#define I2CMCON_LOOPBACK                        I2CMCON_LOOPBACK_Msk

/* I2CMCON[COMPETE] - Start back-off disable */
#define I2CMCON_COMPETE_Pos            (1U)
#define I2CMCON_COMPETE_Msk            (0x1U << I2CMCON_COMPETE_Pos)
#define I2CMCON_COMPETE                         I2CMCON_COMPETE_Msk

/* I2CMCON[MASEN] - Master enable */
#define I2CMCON_MASEN_Pos              (0U)
#define I2CMCON_MASEN_Msk              (0x1U << I2CMCON_MASEN_Pos)
#define I2CMCON_MASEN                           I2CMCON_MASEN_Msk

/* I2CMSTA[SCL_FILTERED] - State of SCL Line */
#define I2CMSTA_SCL_FILTERED_Pos       (14U)
#define I2CMSTA_SCL_FILTERED_Msk       (0x1U << I2CMSTA_SCL_FILTERED_Pos)
#define I2CMSTA_SCL_FILTERED                    I2CMSTA_SCL_FILTERED_Msk

/* I2CMSTA[SDA_FILTERED] - State of SDA Line */
#define I2CMSTA_SDA_FILTERED_Pos       (13U)
#define I2CMSTA_SDA_FILTERED_Msk       (0x1U << I2CMSTA_SDA_FILTERED_Pos)
#define I2CMSTA_SDA_FILTERED                    I2CMSTA_SDA_FILTERED_Msk

/* I2CMSTA[MTXUFLOW] - Master Transmit Underflow */
#define I2CMSTA_MTXUFLOW_Pos           (12U)
#define I2CMSTA_MTXUFLOW_Msk           (0x1U << I2CMSTA_MTXUFLOW_Pos)
#define I2CMSTA_MTXUFLOW                        I2CMSTA_MTXUFLOW_Msk

/* I2CMSTA[MSTOP] - STOP driven by this I2C Master */
#define I2CMSTA_MSTOP_Pos              (11U)
#define I2CMSTA_MSTOP_Msk              (0x1U << I2CMSTA_MSTOP_Pos)
#define I2CMSTA_MSTOP                           I2CMSTA_MSTOP_Msk

/* I2CMSTA[LINEBUSY] - Line is busy */
#define I2CMSTA_LINEBUSY_Pos           (10U)
#define I2CMSTA_LINEBUSY_Msk           (0x1U << I2CMSTA_LINEBUSY_Pos)
#define I2CMSTA_LINEBUSY                        I2CMSTA_LINEBUSY_Msk

/* I2CMSTA[MRXOF] - Master Receive FIFO overflow */
#define I2CMSTA_MRXOF_Pos              (9U)
#define I2CMSTA_MRXOF_Msk              (0x1U << I2CMSTA_MRXOF_Pos)
#define I2CMSTA_MRXOF                           I2CMSTA_MRXOF_Msk

/* I2CMSTA[TCOMP] - Transaction complete or stop detected */
#define I2CMSTA_TCOMP_Pos              (8U)
#define I2CMSTA_TCOMP_Msk              (0x1U << I2CMSTA_TCOMP_Pos)
#define I2CMSTA_TCOMP                           I2CMSTA_TCOMP_Msk

/* I2CMSTA[NACKDATA] - ACK not received in response to data write */
#define I2CMSTA_NACKDATA_Pos           (7U)
#define I2CMSTA_NACKDATA_Msk           (0x1U << I2CMSTA_NACKDATA_Pos)
#define I2CMSTA_NACKDATA                        I2CMSTA_NACKDATA_Msk

/* I2CMSTA[MBUSY] - Master busy */
#define I2CMSTA_MBUSY_Pos              (6U)
#define I2CMSTA_MBUSY_Msk              (0x1U << I2CMSTA_MBUSY_Pos)
#define I2CMSTA_MBUSY                           I2CMSTA_MBUSY_Msk

/* I2CMSTA[ALOST] - Arbitration lost */
#define I2CMSTA_ALOST_Pos              (5U)
#define I2CMSTA_ALOST_Msk              (0x1U << I2CMSTA_ALOST_Pos)
#define I2CMSTA_ALOST                           I2CMSTA_ALOST_Msk

/* I2CMSTA[NACKADDR] - ACK not received in response to an address */
#define I2CMSTA_NACKADDR_Pos           (4U)
#define I2CMSTA_NACKADDR_Msk           (0x1U << I2CMSTA_NACKADDR_Pos)
#define I2CMSTA_NACKADDR                        I2CMSTA_NACKADDR_Msk

/* I2CMSTA[MRXREQ] - Master Receive request */
#define I2CMSTA_MRXREQ_Pos             (3U)
#define I2CMSTA_MRXREQ_Msk             (0x1U << I2CMSTA_MRXREQ_Pos)
#define I2CMSTA_MRXREQ                          I2CMSTA_MRXREQ_Msk

/* I2CMSTA[MTXREQ] - Master Transmit request */
#define I2CMSTA_MTXREQ_Pos             (2U)
#define I2CMSTA_MTXREQ_Msk             (0x1U << I2CMSTA_MTXREQ_Pos)
#define I2CMSTA_MTXREQ                          I2CMSTA_MTXREQ_Msk

/* I2CMSTA[MTXFSTA] - Master Transmit FIFO status */
#define I2CMSTA_MTXFSTA_Pos            (0U)
#define I2CMSTA_MTXFSTA_Msk            (0x3U << I2CMSTA_MTXFSTA_Pos)
#define I2CMSTA_MTXFSTA_EMPTY          (0x0U << I2CMSTA_MTXFSTA_Pos)
#define I2CMSTA_MTXFSTA_ONEBYTE        (0x2U << I2CMSTA_MTXFSTA_Pos)
#define I2CMSTA_MTXFSTA_TWOBYTES       (0x3U << I2CMSTA_MTXFSTA_Pos)

/* I2CMRX[ICMRX] - Master receive register */
#define I2CMRX_ICMRX_Pos               (0U)
#define I2CMRX_ICMRX_Msk               (0xFFU << I2CMRX_ICMRX_Pos)

/* I2CMTX[I2CMTX] - Master transmit register */
#define I2CMTX_I2CMTX_Pos              (0U)
#define I2CMTX_I2CMTX_Msk              (0xFFU << I2CMTX_I2CMTX_Pos)

/* I2CMRXCNT[EXTEND] - Extended read */
#define I2CMRXCNT_EXTEND_Pos           (8U)
#define I2CMRXCNT_EXTEND_Msk           (0x1U << I2CMRXCNT_EXTEND_Pos)
#define I2CMRXCNT_EXTEND                        I2CMRXCNT_EXTEND_Msk

/* I2CMRXCNT[COUNT] - Receive count */
#define I2CMRXCNT_COUNT_Pos            (0U)
#define I2CMRXCNT_COUNT_Msk            (0xFFU << I2CMRXCNT_COUNT_Pos)

/* I2CMCRXCNT[COUNT] - Current receive count */
#define I2CMCRXCNT_COUNT_Pos           (0U)
#define I2CMCRXCNT_COUNT_Msk           (0xFFU << I2CMCRXCNT_COUNT_Pos)

/* I2CADR0[ADR0] - Address byte 0 */
#define I2CADR0_ADR0_Pos               (0U)
#define I2CADR0_ADR0_Msk               (0xFFU << I2CADR0_ADR0_Pos)

/* I2CADR1[ADR1] - Address byte 1 */
#define I2CADR1_ADR1_Pos               (0U)
#define I2CADR1_ADR1_Msk               (0xFFU << I2CADR1_ADR1_Pos)

/* I2CDIV[HIGH] - Serial clock high time */
#define I2CDIV_HIGH_Pos                (8U)
#define I2CDIV_HIGH_Msk                (0xFFU << I2CDIV_HIGH_Pos)

/* I2CDIV[LOW] - Serial clock low time */
#define I2CDIV_LOW_Pos                 (0U)
#define I2CDIV_LOW_Msk                 (0xFFU << I2CDIV_LOW_Pos)

/* I2CSCON[STXDMA] - Enable slave Tx DMA request */
#define I2CSCON_STXDMA_Pos             (14U)
#define I2CSCON_STXDMA_Msk             (0x1U << I2CSCON_STXDMA_Pos)
#define I2CSCON_STXDMA                          I2CSCON_STXDMA_Msk

/* I2CSCON[SRXDMA] - Enable slave Rx DMA request */
#define I2CSCON_SRXDMA_Pos             (13U)
#define I2CSCON_SRXDMA_Msk             (0x1U << I2CSCON_SRXDMA_Pos)
#define I2CSCON_SRXDMA                          I2CSCON_SRXDMA_Msk

/* I2CSCON[IENREPST] - Repeated start interrupt enable */
#define I2CSCON_IENREPST_Pos           (12U)
#define I2CSCON_IENREPST_Msk           (0x1U << I2CSCON_IENREPST_Pos)
#define I2CSCON_IENREPST                        I2CSCON_IENREPST_Msk

/* I2CSCON[SXMITDEC] - Decrement Slave Tx FIFO status when a byte has been transmitted */
#define I2CSCON_SXMITDEC_Pos           (11U)
#define I2CSCON_SXMITDEC_Msk           (0x1U << I2CSCON_SXMITDEC_Pos)
#define I2CSCON_SXMITDEC                        I2CSCON_SXMITDEC_Msk

/* I2CSCON[IENSTX] - Slave Transmit request interrupt enable */
#define I2CSCON_IENSTX_Pos             (10U)
#define I2CSCON_IENSTX_Msk             (0x1U << I2CSCON_IENSTX_Pos)
#define I2CSCON_IENSTX                          I2CSCON_IENSTX_Msk

/* I2CSCON[IENSRX] - Slave Receive request interrupt enable */
#define I2CSCON_IENSRX_Pos             (9U)
#define I2CSCON_IENSRX_Msk             (0x1U << I2CSCON_IENSRX_Pos)
#define I2CSCON_IENSRX                          I2CSCON_IENSRX_Msk

/* I2CSCON[IENSTOP] - Stop condition detected interrupt enable */
#define I2CSCON_IENSTOP_Pos            (8U)
#define I2CSCON_IENSTOP_Msk            (0x1U << I2CSCON_IENSTOP_Pos)
#define I2CSCON_IENSTOP                         I2CSCON_IENSTOP_Msk

/* I2CSCON[NACK] - NACK next communication */
#define I2CSCON_NACK_Pos               (7U)
#define I2CSCON_NACK_Msk               (0x1U << I2CSCON_NACK_Pos)
#define I2CSCON_NACK                            I2CSCON_NACK_Msk

/* I2CSCON[STRETCHSCL] - Stretch SCL enable */
#define I2CSCON_STRETCHSCL_Pos         (6U)
#define I2CSCON_STRETCHSCL_Msk         (0x1U << I2CSCON_STRETCHSCL_Pos)
#define I2CSCON_STRETCHSCL                      I2CSCON_STRETCHSCL_Msk

/* I2CSCON[EARLYTXR] - Early transmit request mode */
#define I2CSCON_EARLYTXR_Pos           (5U)
#define I2CSCON_EARLYTXR_Msk           (0x1U << I2CSCON_EARLYTXR_Pos)
#define I2CSCON_EARLYTXR                        I2CSCON_EARLYTXR_Msk

/* I2CSCON[GCSBCLR] - General call status bit clear */
#define I2CSCON_GCSBCLR_Pos            (4U)
#define I2CSCON_GCSBCLR_Msk            (0x1U << I2CSCON_GCSBCLR_Pos)
#define I2CSCON_GCSBCLR                         I2CSCON_GCSBCLR_Msk

/* I2CSCON[HGCEN] - Hardware general call enable */
#define I2CSCON_HGCEN_Pos              (3U)
#define I2CSCON_HGCEN_Msk              (0x1U << I2CSCON_HGCEN_Pos)
#define I2CSCON_HGCEN                           I2CSCON_HGCEN_Msk

/* I2CSCON[GCEN] - General call enable */
#define I2CSCON_GCEN_Pos               (2U)
#define I2CSCON_GCEN_Msk               (0x1U << I2CSCON_GCEN_Pos)
#define I2CSCON_GCEN                            I2CSCON_GCEN_Msk

/* I2CSCON[ADR10EN] - Enabled 10-bit addressing */
#define I2CSCON_ADR10EN_Pos            (1U)
#define I2CSCON_ADR10EN_Msk            (0x1U << I2CSCON_ADR10EN_Pos)
#define I2CSCON_ADR10EN                         I2CSCON_ADR10EN_Msk

/* I2CSCON[SLVEN] - Slave enable */
#define I2CSCON_SLVEN_Pos              (0U)
#define I2CSCON_SLVEN_Msk              (0x1U << I2CSCON_SLVEN_Pos)
#define I2CSCON_SLVEN                           I2CSCON_SLVEN_Msk

/* I2CSSTA[START] - Start and matching address */
#define I2CSSTA_START_Pos              (14U)
#define I2CSSTA_START_Msk              (0x1U << I2CSSTA_START_Pos)
#define I2CSSTA_START                           I2CSSTA_START_Msk

/* I2CSSTA[REPSTART] - Repeated start and matching address */
#define I2CSSTA_REPSTART_Pos           (13U)
#define I2CSSTA_REPSTART_Msk           (0x1U << I2CSSTA_REPSTART_Pos)
#define I2CSSTA_REPSTART                        I2CSSTA_REPSTART_Msk

/* I2CSSTA[IDMAT] - Device ID matched */
#define I2CSSTA_IDMAT_Pos              (11U)
#define I2CSSTA_IDMAT_Msk              (0x3U << I2CSSTA_IDMAT_Pos)

/* I2CSSTA[STOP] - Stop after start and matching address */
#define I2CSSTA_STOP_Pos               (10U)
#define I2CSSTA_STOP_Msk               (0x1U << I2CSSTA_STOP_Pos)
#define I2CSSTA_STOP                            I2CSSTA_STOP_Msk

/* I2CSSTA[GCID] - General ID */
#define I2CSSTA_GCID_Pos               (8U)
#define I2CSSTA_GCID_Msk               (0x3U << I2CSSTA_GCID_Pos)

/* I2CSSTA[GCINT] - General call interrupt */
#define I2CSSTA_GCINT_Pos              (7U)
#define I2CSSTA_GCINT_Msk              (0x1U << I2CSSTA_GCINT_Pos)
#define I2CSSTA_GCINT                           I2CSSTA_GCINT_Msk

