koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* I2CSSTA[SBUSY] - Slave busy */
#define I2CSSTA_SBUSY_Pos              (6U)
#define I2CSSTA_SBUSY_Msk              (0x1U << I2CSSTA_SBUSY_Pos)
#define I2CSSTA_SBUSY                           I2CSSTA_SBUSY_Msk

/* I2CSSTA[NOACK] - Ack not generated by the slave */
#define I2CSSTA_NOACK_Pos              (5U)
#define I2CSSTA_NOACK_Msk              (0x1U << I2CSSTA_NOACK_Pos)
#define I2CSSTA_NOACK                           I2CSSTA_NOACK_Msk

/* I2CSSTA[SRXOF] - Slave Receive FIFO overflow */
#define I2CSSTA_SRXOF_Pos              (4U)
#define I2CSSTA_SRXOF_Msk              (0x1U << I2CSSTA_SRXOF_Pos)
#define I2CSSTA_SRXOF                           I2CSSTA_SRXOF_Msk

/* I2CSSTA[SRXREQ] - Slave Receive request */
#define I2CSSTA_SRXREQ_Pos             (3U)
#define I2CSSTA_SRXREQ_Msk             (0x1U << I2CSSTA_SRXREQ_Pos)
#define I2CSSTA_SRXREQ                          I2CSSTA_SRXREQ_Msk

/* I2CSSTA[STXREQ] - Slave Transmit request */
#define I2CSSTA_STXREQ_Pos             (2U)
#define I2CSSTA_STXREQ_Msk             (0x1U << I2CSSTA_STXREQ_Pos)
#define I2CSSTA_STXREQ                          I2CSSTA_STXREQ_Msk

/* I2CSSTA[STXUR] - Slave Transmit FIFO underflow */
#define I2CSSTA_STXUR_Pos              (1U)
#define I2CSSTA_STXUR_Msk              (0x1U << I2CSSTA_STXUR_Pos)
#define I2CSSTA_STXUR                           I2CSSTA_STXUR_Msk

/* I2CSSTA[STXFSEREQ] - Slave Tx FIFO Status or early request */
#define I2CSSTA_STXFSEREQ_Pos          (0U)
#define I2CSSTA_STXFSEREQ_Msk          (0x1U << I2CSSTA_STXFSEREQ_Pos)
#define I2CSSTA_STXFSEREQ                       I2CSSTA_STXFSEREQ_Msk

/* I2CSRX[I2CSRX] - Slave receive register */
#define I2CSRX_I2CSRX_Pos              (0U)
#define I2CSRX_I2CSRX_Msk              (0xFFU << I2CSRX_I2CSRX_Pos)

/* I2CSTX[I2CSTX] - Slave transmit register */
#define I2CSTX_I2CSTX_Pos              (0U)
#define I2CSTX_I2CSTX_Msk              (0xFFU << I2CSTX_I2CSTX_Pos)

/* I2CALT[ALT] - Slave Alt */
#define I2CALT_ALT_Pos                 (0U)
#define I2CALT_ALT_Msk                 (0xFFU << I2CALT_ALT_Pos)

/* I2CID0[ID0] - Slave device ID 0 */
#define I2CID0_ID0_Pos                 (0U)
#define I2CID0_ID0_Msk                 (0xFFU << I2CID0_ID0_Pos)

/* I2CID1[ID1] - Slave device ID 1 */
#define I2CID1_ID1_Pos                 (0U)
#define I2CID1_ID1_Msk                 (0xFFU << I2CID1_ID1_Pos)

/* I2CID2[ID2] - Slave device ID 2 */
#define I2CID2_ID2_Pos                 (0U)
#define I2CID2_ID2_Msk                 (0xFFU << I2CID2_ID2_Pos)

/* I2CID3[ID3] - Slave device ID 3 */
#define I2CID3_ID3_Pos                 (0U)
#define I2CID3_ID3_Msk                 (0xFFU << I2CID3_ID3_Pos)

/* I2CFSTA[MFLUSH] - Flush the master transmit FIFO */
#define I2CFSTA_MFLUSH_Pos             (9U)
#define I2CFSTA_MFLUSH_Msk             (0x1U << I2CFSTA_MFLUSH_Pos)
#define I2CFSTA_MFLUSH                          I2CFSTA_MFLUSH_Msk

/* I2CFSTA[SFLUSH] - Flush the slave transmit FIFO */
#define I2CFSTA_SFLUSH_Pos             (8U)
#define I2CFSTA_SFLUSH_Msk             (0x1U << I2CFSTA_SFLUSH_Pos)
#define I2CFSTA_SFLUSH                          I2CFSTA_SFLUSH_Msk

/* I2CFSTA[MRXFSTA] - Master receive FIFO status */
#define I2CFSTA_MRXFSTA_Pos            (6U)
#define I2CFSTA_MRXFSTA_Msk            (0x3U << I2CFSTA_MRXFSTA_Pos)
#define I2CFSTA_MRXFSTA_EMPTY          (0x0U << I2CFSTA_MRXFSTA_Pos)
#define I2CFSTA_MRXFSTA_ONEBYTE        (0x1U << I2CFSTA_MRXFSTA_Pos)
#define I2CFSTA_MRXFSTA_TWOBYTES       (0x2U << I2CFSTA_MRXFSTA_Pos)

/* I2CFSTA[MTXFSTA] - Master transmit FIFO status */
#define I2CFSTA_MTXFSTA_Pos            (4U)
#define I2CFSTA_MTXFSTA_Msk            (0x3U << I2CFSTA_MTXFSTA_Pos)
#define I2CFSTA_MTXFSTA_EMPTY          (0x0U << I2CFSTA_MTXFSTA_Pos)
#define I2CFSTA_MTXFSTA_ONEBYTE        (0x1U << I2CFSTA_MTXFSTA_Pos)
#define I2CFSTA_MTXFSTA_TWOBYTES       (0x2U << I2CFSTA_MTXFSTA_Pos)

/* I2CFSTA[SRXFSTA] - Slave receive FIFO status */
#define I2CFSTA_SRXFSTA_Pos            (2U)
#define I2CFSTA_SRXFSTA_Msk            (0x3U << I2CFSTA_SRXFSTA_Pos)
#define I2CFSTA_SRXFSTA_EMPTY          (0x0U << I2CFSTA_SRXFSTA_Pos)
#define I2CFSTA_SRXFSTA_ONEBYTE        (0x1U << I2CFSTA_SRXFSTA_Pos)
#define I2CFSTA_SRXFSTA_TWOBYTES       (0x2U << I2CFSTA_SRXFSTA_Pos)

/* I2CFSTA[STXFSTA] - Slave transmit FIFO status */
#define I2CFSTA_STXFSTA_Pos            (0U)
#define I2CFSTA_STXFSTA_Msk            (0x3U << I2CFSTA_STXFSTA_Pos)
#define I2CFSTA_STXFSTA_EMPTY          (0x0U << I2CFSTA_STXFSTA_Pos)
#define I2CFSTA_STXFSTA_ONEBYTE        (0x1U << I2CFSTA_STXFSTA_Pos)
#define I2CFSTA_STXFSTA_TWOBYTES       (0x2U << I2CFSTA_STXFSTA_Pos)

/* I2CSHCON[RESET] - Reset START STOP detect circuit */
#define I2CSHCON_RESET_Pos             (0U)
#define I2CSHCON_RESET_Msk             (0x1U << I2CSHCON_RESET_Pos)
#define I2CSHCON_RESET                          I2CSHCON_RESET_Msk

#if defined(ADUCM320I) | defined(ADUCM322) | defined(ADUCM322I)

/* I2CASSCL[SSRTSTA] - stretch timeout for slave */
#define I2CASSCL_SSRTSTA_Pos           (9U)
#define I2CASSCL_SSRTSTA_Msk           (0x1U << I2CASSCL_SSRTSTA_Pos)
#define I2CASSCL_SSRTSTA                        I2CASSCL_SSRTSTA_Msk

/* I2CASSCL[MSRTSTA] - stretch timeout for master */
#define I2CASSCL_MSRTSTA_Pos           (8U)
#define I2CASSCL_MSRTSTA_Msk           (0x1U << I2CASSCL_MSRTSTA_Pos)
#define I2CASSCL_MSRTSTA                        I2CASSCL_MSRTSTA_Msk

/* I2CASSCL[SSTRCON] - automatic stretch mode for slave */
#define I2CASSCL_SSTRCON_Pos           (4U)
#define I2CASSCL_SSTRCON_Msk           (0xFU << I2CASSCL_SSTRCON_Pos)

/* I2CASSCL[MSTRCON] - automatic stretch mode for master */
#define I2CASSCL_MSTRCON_Pos           (0U)
#define I2CASSCL_MSTRCON_Msk           (0xFU << I2CASSCL_MSTRCON_Pos)

#endif


// ------------------------------------------------------------------------------------------------
// -----                                        uart0                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief UART (MMR_UART)
  */
typedef struct MMR_UART {                   /*!< MMR_UART Structure                    */
  __IO uint16_t  COMDAT;                    /*!< Transmit holding register & Receive buffer register */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  COMIEN;                    /*!< Interrupt enable register             */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  COMIIR;                    /*!< Interrupt identification register     */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  COMLCR;                    /*!< Line control register                 */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  COMMCR;                    /*!< Modem control register                */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  COMLSR;                    /*!< Line status register                  */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  COMMSR;                    /*!< Modem status register                 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  COMSCR;                    /*!< Scratch buffer register               */
  __I  uint16_t  RESERVED7[3];
  __IO uint16_t  COMFBR;                    /*!< Fractional baud rate register         */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  COMDIV;                    /*!< Baud rate divider register            */
} MMR_UART_t;

/* Reset Value for COMTX*/
#define COMTX_RVAL                     0x0 

/* COMTX[THR] - Transmit Holding Register */
#define COMTX_THR_MSK                  (0xFF  << 0  )

/* Reset Value for COMRX*/
#define COMRX_RVAL                     0x0 

/* COMRX[RBR] - Receive Buffer Register */
#define COMRX_RBR_MSK                  (0xFF  << 0  )

/* Reset Value for COMIEN*/
#define COMIEN_RVAL                    0x0 

/* COMIEN[EDMAR] - DMA requests in receive mode */
#define COMIEN_EDMAR_BBA               (*(volatile unsigned long *) 0x420A0094)
#define COMIEN_EDMAR_MSK               (0x1   << 5  )
#define COMIEN_EDMAR                   (0x1   << 5  )
#define COMIEN_EDMAR_DIS               (0x0   << 5  ) /* DMA requests disabled    */
#define COMIEN_EDMAR_EN                (0x1   << 5  ) /* DMA requests enabled     */

/* COMIEN[EDMAT] - DMA requests in transmit mode */
#define COMIEN_EDMAT_BBA               (*(volatile unsigned long *) 0x420A0090)
#define COMIEN_EDMAT_MSK               (0x1   << 4  )
#define COMIEN_EDMAT                   (0x1   << 4  )
#define COMIEN_EDMAT_DIS               (0x0   << 4  ) /* DMA requests are disabled */
#define COMIEN_EDMAT_EN                (0x1   << 4  ) /* DMA requests are enabled */

/* COMIEN[EDSSI] - Modem status interrupt */
#define COMIEN_EDSSI_BBA               (*(volatile unsigned long *) 0x420A008C)
#define COMIEN_EDSSI_MSK               (0x1   << 3  )
#define COMIEN_EDSSI                   (0x1   << 3  )
#define COMIEN_EDSSI_DIS               (0x0   << 3  ) /* Interrupt disabled       */
#define COMIEN_EDSSI_EN                (0x1   << 3  ) /* Interrupt enabled        */

