koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* Reset Value for DMAENSET*/
#define DMAENSET_RVAL                  0x0 

/* DMAENSET[CHENSET] - Enable DMA channels */
#define DMAENSET_CHENSET_MSK           (0x3FFF << 0  )

/* Reset Value for DMAENCLR*/
#define DMAENCLR_RVAL                  0x0 

/* DMAENCLR[CHENCLR] - Disable DMA channels */
#define DMAENCLR_CHENCLR_MSK           (0x3FFF << 0  )

/* Reset Value for DMAALTSET*/
#define DMAALTSET_RVAL                 0x0 

/* DMAALTSET[CHPRIALTSET] - Control struct status / select alt struct */
#define DMAALTSET_CHPRIALTSET_MSK      (0x3FFF << 0  )

/* Reset Value for DMAALTCLR*/
#define DMAALTCLR_RVAL                 0x0 

/* DMAALTCLR[CHPRIALTCLR] - Select primary data struct */
#define DMAALTCLR_CHPRIALTCLR_MSK      (0x3FFF << 0  )

/* Reset Value for DMAPRISET*/
#define DMAPRISET_RVAL                 0x0 

/* DMAPRISET[CHPRISET] - Configure channel for high priority */
#define DMAPRISET_CHPRISET_MSK         (0x3FFF << 0  )

/* Reset Value for DMAPRICLR*/
#define DMAPRICLR_RVAL                 0x0 

/* DMAPRICLR[CHPRICLR] - Configure channel for default priority level */
#define DMAPRICLR_CHPRICLR_MSK         (0x3FFF << 0  )

/* Reset Value for DMAERRCLR*/
#define DMAERRCLR_RVAL                 0x0 

/* DMAERRCLR[ERRCLR] - Bus error status */
#define DMAERRCLR_ERRCLR_MSK           (0x3FFF << 0  )

/* Reset Value for DMABSSET*/
#define DMABSSET_RVAL                  0x0 

/* DMABSSET[CHBSWAPSET] - Byte swap status */
#define DMABSSET_CHBSWAPSET_MSK        (0x3FFF << 0  )

/* Reset Value for DMABSCLR*/
#define DMABSCLR_RVAL                  0x0 

/* DMABSCLR[CHBSWAPCLR] - Disable byte swap */
#define DMABSCLR_CHBSWAPCLR_MSK        (0x3FFF << 0  )


/* ========================================================================== */
/* ================         FLASH CONTROLLER               ================== */
/* ========================================================================== */

/**
  * @brief FEE (MMR_FEE)
  */

typedef struct MMR_FEE {              // MMR_FEE Structure
  __I  uint32_t  FEESTA;              // Status register
  __IO uint32_t  FEECON0;             // Command Control register: interrupt enable register
  __IO uint32_t  FEECMD;              // Command register
  __IO uint32_t  FEEFLADR;            // Flash address key - hole register
  __IO uint32_t  FEEFLDATA0;          // Flash Data register: key-hole interface lower 32 bits
  __IO uint32_t  FEEFLDATA1;          // Flash Data register: key-hole interface upper 32 bits
  __IO uint32_t  FEEADR0;             // Lower page address register
  __IO uint32_t  FEEADR1;             // Upper page address register
  __O  uint32_t  FEEKEY;              // Flash Key register.
  __I  uint32_t  RESERVED0;
  __IO uint32_t  FEEPRO0;             // Write protection register for flash0
  __IO uint32_t  FEEPRO1;             // Write protection register for flash1
  __I  uint32_t  RESERVED1;
  __I  uint32_t  FEESIG;              // Flash Signature
  __IO uint32_t  FEECON1;             // User Setup register
  __I  uint32_t  RESERVED2;
  __I  uint32_t  FEEWRADDRA;          // Write abort address register
  __I  uint32_t  RESERVED3;
  __IO uint32_t  FEEAEN0;             // Interrupt abort enable register. Interrupt 31 to Interrupt 0.
  __IO uint32_t  FEEAEN1;             // Interrupt abort enable register. Interrupt 54 to Interrupt 32.
  __I  uint32_t  RESERVED4[5];
  __IO uint32_t  FEEECCCONFIG;        // Configurable ECC enable/disable, error response
  __I  uint32_t  RESERVED5[3];
  __I  uint32_t  FEEECCADDR0;         // Flash 0 ECC Error Address
  __I  uint32_t  FEEECCADDR1;         // Flash 1 ECC Error Address
  __I  uint32_t  RESERVED6[17];
  __I  uint32_t  CACHESTAT;           // Cache Status register
  __IO uint32_t  CACHESETUP;          // Cache Setup register
  __O  uint32_t  CACHEKEY;            // Cache Key register
} MMR_FEE_t;

/* FEESTA[SIGNERR] - Information space signature check on reset error. */
#define FEESTA_SIGNERR_Pos             (13U)
#define FEESTA_SIGNERR_Msk             (0x1U << FEESTA_SIGNERR_Pos)
#define FEESTA_SIGNERR                          FEESTA_SIGNERR_Msk

/* FEESTA[CMDRES] - These two bits indicate the status of a command on completion or the status of a write. */
#define FEESTA_CMDRES_Pos              (4U)
#define FEESTA_CMDRES_Msk              (0x3U << FEESTA_CMDRES_Pos)
#define FEESTA_CMDRES_SUCCESS          (0x0U << FEESTA_CMDRES_Pos)              /* Successful completion of a command or a write */
#define FEESTA_CMDRES_IGNORED          (0x1U << FEESTA_CMDRES_Pos)              /* Attempted signcheck, write or erase of a protected location. */
#define FEESTA_CMDRES_READERROR        (0x2U << FEESTA_CMDRES_Pos)              /* Read verify error. After an erase the controller reads the corresponding word(s) to verify that the transaction completed successfully. If data read is not all 'F's this is the resulting status.If the Sign command is executed and the resulting signature does not match the data in the upper 4 bytes of the upper page in a block then this is the resulting status. */
#define FEESTA_CMDRES_ABORTED          (0x3U << FEESTA_CMDRES_Pos)              /* Indicates that a command or a write was aborted by an abort command or a system interrupt has caused an abort */

/* FEESTA[WRALMOSTDONE] - Write almost Complete - key-hole registers open for access. This bit flags the earliest point at which the flash controller data and address may be updated for the next command without affecting an active flash command operation. */
#define FEESTA_WRALMOSTDONE_Pos        (3U)
#define FEESTA_WRALMOSTDONE_Msk        (0x1U << FEESTA_WRALMOSTDONE_Pos)
#define FEESTA_WRALMOSTDONE                     FEESTA_WRALMOSTDONE_Msk

/* FEESTA[CMDDONE] - This bit asserts when a command completes. */
#define FEESTA_CMDDONE_Pos             (2U)
#define FEESTA_CMDDONE_Msk             (0x1U << FEESTA_CMDDONE_Pos)
#define FEESTA_CMDDONE                          FEESTA_CMDDONE_Msk

/* FEESTA[WRCLOSE] - This bit is asserted when the user has written all key-hole registers for flash write and the controller has started the write. */
#define FEESTA_WRCLOSE_Pos             (1U)
#define FEESTA_WRCLOSE_Msk             (0x1U << FEESTA_WRCLOSE_Pos)
#define FEESTA_WRCLOSE                          FEESTA_WRCLOSE_Msk

/* FEESTA[CMDBUSY] - Command busy. */
#define FEESTA_CMDBUSY_Pos             (0U)
#define FEESTA_CMDBUSY_Msk             (0x1U << FEESTA_CMDBUSY_Pos)
#define FEESTA_CMDBUSY                          FEESTA_CMDBUSY_Msk


