koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* FEECON0[IENERR] - Command fail interrupt enable */
#define FEECON0_IENERR_Pos             (2U)
#define FEECON0_IENERR_Msk             (0x1U << FEECON0_IENERR_Pos)
#define FEECON0_IENERR                          FEECON0_IENERR_Msk

/* FEECON0[IWRALCOMP] - Write almost complete interrupt enable */
#define FEECON0_IWRALCOMP_Pos          (1U)
#define FEECON0_IWRALCOMP_Msk          (0x1U << FEECON0_IWRALCOMP_Pos)
#define FEECON0_IWRALCOMP                       FEECON0_IWRALCOMP_Msk

/* FEECON0[IENCMD] - Command complete interrupt enable */
#define FEECON0_IENCMD_Pos             (0U)
#define FEECON0_IENCMD_Msk             (0x1U << FEECON0_IENCMD_Pos)
#define FEECON0_IENCMD                          FEECON0_IENCMD_Msk


/* FEECMD[CMD] - Commands */
#define FEECMD_CMD_Pos                 (0U)
#define FEECMD_CMD_Msk                 (0x1FU << FEECMD_CMD_Pos)
#define FEECMD_CMD_IDLE                (0x00U << FEECMD_CMD_Pos)                /* IDLE. No command executed. */
#define FEECMD_CMD_PAGEERASE           (0x01U << FEECMD_CMD_Pos)                /* PAGEERASE. Write the address of the page to be erased to the FEEADR0 register, then write this code to the FEECMD and the flash will erase the page. When the erase has completed the flash will read every location in the page to verify all words in the page are erased.  If there is a read verify error this will be indicated in the Status register.  To erase multiple pages wait until a previous page erase has completed - check the status then issue a command to start the next page erase.  Before entering this command  0xF123F456 must first be written to the FEEKEY register. */
#define FEECMD_CMD_SIGN                (0x02U << FEECMD_CMD_Pos)                /* SIGN. Use this command to generate a signature for a block of data.  The signature is generated on a page by page basis.  To generate a signature the address of the first page of the block is entered in the FEEADR0 register, the address of the last page is written to the FEEADR1 register, then write this code to the FEECMD register.  When the command has completed the signature is available for reading in the Sign register.  The last 4 bytes of the last page in a block is reserved for storing the signature. Before entering this command 0xF123F456 must first be written to the FEEKEY register. */
#define FEECMD_CMD_WRITE               (0x04U << FEECMD_CMD_Pos)                /* WRITE. Use this command to write to flash locations. This command needs a UserKey for writing into write protection location and userfaakey location. No key is required for other flash locations. This command takes the address, data from FEEADR, FEEFLDATA key-hole registers. */
#define FEECMD_CMD_MASSERASE0          (0x05U << FEECMD_CMD_Pos)                /* MASSERASE0. Erase all of flash0 user space. To enable this operation 0xF123F456 must first be written to the FEEKEY register (this is to prevent accidental erases).  When the mass erase has completed the controller will read every location to verify that all locations are 0xFFFFFFFFFFFFFFFF.  If there is a read verify error this will be indicated in the Status register. */
#define FEECMD_CMD_MASSERASE1          (0x06U << FEECMD_CMD_Pos)                /* MASSERASE1. Erase all of flash1 user space. To enable this operation 0xF123F456 must first be written to the FEEKEY register (this is to prevent accidental erases).  When the mass erase has completed the controller will read every location to verify that all locations are 0xFFFFFFFFFFFFFFFF.  If there is a read verify error this will be indicated in the Status register. */
#define FEECMD_CMD_ABORT               (0x08U << FEECMD_CMD_Pos)                /* ABORT. If this command is issued then any command currently in progress will be stopped.  The status will indicate command completed with an error status (FEESTA[5:4] = 0x3).  Note that this is the only command that can be issued while another command is already in progress.  This command can also be used to stop a write that may be in progress. If a write or erase is aborted then the flash timing will be violated and it is not possible to determine if the write or erase completed successfully.  To enable this operation 0xF123F456 must first be written to the FEEKEY register (this is to prevent accidental aborts). */


/* FEEFLADR[FLADDR] - Memory mapped address for the flash location */
#define FEEFLADR_FLADDR_Pos            (3U)
#define FEEFLADR_FLADDR_Msk            (0xFFFFU << FEEFLADR_FLADDR_Pos)


/* FEEFLDATA0[FLDATA0] - FLDATA0 forms the lower 32 bit of 64 bit data to be written to flash */
#define FEEFLDATA0_FLDATA0_Pos         (0U)
#define FEEFLDATA0_FLDATA0_Msk         (0xFFFFFFFFU << FEEFLDATA0_FLDATA0_Pos)


/* FEEFLDATA1[FLDATA1] - FLDATA1 forms the upper 32 bit of 64 bit data to be written to flash */
#define FEEFLDATA0_FLDATA1_Pos         (0U)
#define FEEFLDATA0_FLDATA1_Msk         (0xFFFFFFFFU << FEEFLDATA0_FLDATA1_Pos)


/* FEEADR0[PAGEADDR0] - Used by SIGN and PAGEERASE commands for specifying page address. See the description of these commands in FEECMD */
#define FEEADR0_PAGEADDR0_Pos          (11U)
#define FEEADR0_PAGEADDR0_Msk          (0xFFU << FEEADR0_PAGEADDR0_Pos)


/* FEEADR1[PAGEADDR1] - Used by SIGN command for specifying the end page address. See description of this command in FEECMD */
#define FEEADR0_PAGEADDR1_Pos          (11U)
#define FEEADR0_PAGEADDR1_Msk          (0xFFU << FEEADR0_PAGEADDR1_Pos)


/* FEEKEY[KEY] - Enter 0xF123F456 to allow key protected operations. Returns 0x0 if read. */
#define FEEKEY_KEY_Pos                 (0U)
#define FEEKEY_KEY_Msk                 (0xFFFFFFFFU << FEEKEY_KEY_Pos)
#define FEEKEY_KEY                     (0xF123F456U << FEEKEY_KEY_Pos)


/* FEEPRO0[WRPROT0] - Write protection for flash0 - 32 bits. */
#define FEEPRO0_WRPROT0_Pos            (0U)
#define FEEPRO0_WRPROT0_Msk            (0xFFFFFFFFU << FEEPRO0_WRPROT0_Pos)


/* FEEPRO1[WRPROT1] - Write protection for flash1 - 32 bits. */
#define FEEPRO1_WRPROT1_Pos            (0U)
#define FEEPRO1_WRPROT1_Msk            (0xFFFFFFFFU << FEEPRO1_WRPROT1_Pos)


