koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* FEESIG[SIGN] - 24 bit signature. */
#define FEESIG_SIGN_Pos                (0U)
#define FEESIG_SIGN_Msk                (0xFFFFFFU << FEESIG_SIGN_Pos)


/* FEECON1[MDIO] - MDIO mode */
#define FEECON1_MDIO_Pos               (4U)
#define FEECON1_MDIO_Msk               (0x1U << FEECON1_MDIO_Pos)
#define FEECON1_MDIO                            FEECON1_MDIO_Msk

/* FEECON1[SWAP] - Swap program code for MDIO mode. */
#define FEECON1_SWAP_Pos               (3U)
#define FEECON1_SWAP_Msk               (0x1U << FEECON1_SWAP_Pos)
#define FEECON1_SWAP                            FEECON1_SWAP_Msk

/* FEECON1[INCR] - Auto increment FEEFLAADR for non DMA operation. */
#define FEECON1_INCR_Pos               (2U)
#define FEECON1_INCR_Msk               (0x1U << FEECON1_INCR_Pos)
#define FEECON1_INCR                            FEECON1_INCR_Msk

/* FEECON1[KHDMA] - Key-hole DMA enable. */
#define FEECON1_KHDMA_Pos              (1U)
#define FEECON1_KHDMA_Msk              (0x1U << FEECON1_KHDMA_Pos)
#define FEECON1_KHDMA                           FEECON1_KHDMA_Msk

/* FEECON1[DBG] - JTAG debug enable */
#define FEECON1_DBG_Pos                (0U)
#define FEECON1_DBG_Msk                (0x1U << FEECON1_DBG_Pos)
#define FEECON1_DBG                             FEECON1_DBG_Msk


/* FEEWRADDRA[WRABORTADDR] - If a write is aborted then this will contain the address of the location been written when the write was aborted. This register has appropriate value if command abort happened. This has to be read after the command is aborted. And this has to be read before any other command is given. After reset the value will be random. */
#define FEEWRADDRA_WRABORTADDR_Pos     (0U)
#define FEEWRADDRA_WRABORTADDR_Msk     (0xFFFFFFFFU << FEEWRADDRA_WRABORTADDR_Pos)


/* FEEAEN0[SYSIRQABORTEN] - Lower 32 bits of System Interrupt Abort Enable. To allow a system interrupt to abort a command (write, erase, sign or mass verify) then write a '1' to the appropriate bit in this register. */
#define FEEAEN0_SYSIRQABORTEN_Pos      (0U)
#define FEEAEN0_SYSIRQABORTEN_Msk      (0xFFFFFFFFU << FEEAEN0_SYSIRQABORTEN_Pos)


/* FEEAEN1[SYSIRQABORTEN] - Upper 23 bits of System Interrupt Abort Enable. To allow a system interrupt to abort a command (write, erase, sign or mass verify) then write a '1' to the appropriate bit in this register. */
#define FEEAEN1_SYSIRQABORTEN_Pos      (0U)
#define FEEAEN1_SYSIRQABORTEN_Msk      (0x7FFFFFU << FEEAEN1_SYSIRQABORTEN_Pos)


/* FEEECCCONFIG[INT] - Interrupt enable when a ECC error happens during an AHB read from program or data flash. */
#define FEEECCCONFIG_INT_Pos           (3U)
#define FEEECCCONFIG_INT_Msk           (0x3U << FEEECCCONFIG_INT_Pos)

/* FEEECCCONFIG[FAULT] - Signifies when to generate AHB error (HRESP = 1) when an ECC error happens - 1 bit error or 2 bit error. */
#define FEEECCCONFIG_FAULT_Pos         (1U)
#define FEEECCCONFIG_FAULT_Msk         (0x3U << FEEECCCONFIG_FAULT_Pos)

/* FEEECCCONFIG[DIS] - ECC Disable bit. */
#define FEEECCCONFIG_DIS_Pos           (0U)
#define FEEECCCONFIG_DIS_Msk           (0x1U << FEEECCCONFIG_DIS_Pos)
#define FEEECCCONFIG_DIS                        FEEECCCONFIG_DIS_Msk


/* FEEECCADDR0[VALUE] - This register has the address of flash0 for which ECC error is detected. */
#define FEEECCADDR0_VALUE_Pos          (0U)
#define FEEECCADDR0_VALUE_Msk          (0x7FFFFU << FEEECCADDR0_VALUE_Msk)


/* FEEECCADDR1[VALUE] - This register has the address of flash1 for which ECC error is detected. */
#define FEEECCADDR1_VALUE_Pos          (0U)
#define FEEECCADDR1_VALUE_Msk          (0x7FFFFU << FEEECCADDR1_VALUE_Msk)


/* CACHESTAT[DLOCK] - This bit is set when D-Cache is locked and cleared when D-cache is unlocked. */
#define CACHESTAT_DLOCK_Pos            (18U)
#define CACHESTAT_DLOCK_Msk            (0x1U << CACHESTAT_DLOCK_Pos)
#define CACHESTAT_DLOCK                         CACHESTAT_DLOCK_Msk

/* CACHESTAT[DEN] - If this bit is set then D-Cache is enabled and when cleared D-Cache is disabled. This is also cleared when CACHESTAT[16] is set. */
#define CACHESTAT_DEN_Pos              (17U)
#define CACHESTAT_DEN_Msk              (0x1U << CACHESTAT_DEN_Pos)
#define CACHESTAT_DEN                           CACHESTAT_DEN_Msk

/* CACHESTAT[DINIT] - It is set when D-cache memory initialization starts and clears when initialization is done. D-Cache is disabled when this bit is set. */
#define CACHESTAT_DINIT_Pos            (16U)
#define CACHESTAT_DINIT_Msk            (0x1U << CACHESTAT_DINIT_Pos)
#define CACHESTAT_DINIT                         CACHESTAT_DINIT_Msk

/* CACHESTAT[ILOCK] - This bit is set when I-Cache is locked and cleared when I-cache is unlocked. */
#define CACHESTAT_ILOCK_Pos            (2U)
#define CACHESTAT_ILOCK_Msk            (0x1U << CACHESTAT_ILOCK_Pos)
#define CACHESTAT_ILOCK                         CACHESTAT_ILOCK_Msk

/* CACHESTAT[IEN] - If this bit is set then I-Cache is enabled and when cleared I-Cache is disabled. This is also cleared when CACHESTAT[0] is set. */
#define CACHESTAT_IEN_Pos              (1U)
#define CACHESTAT_IEN_Msk              (0x1U << CACHESTAT_IEN_Pos)
#define CACHESTAT_IEN                           CACHESTAT_IEN_Msk

/* CACHESTAT[IINIT] - It is set when I-cache memory initialization starts and clears when initialization is done. I-Cache is disabled when this bit is set. */
#define CACHESTAT_IINIT_Pos            (0U)
#define CACHESTAT_IINIT_Msk            (0x1U << CACHESTAT_IINIT_Pos)
#define CACHESTAT_IINIT                         CACHESTAT_IINIT_Msk


/* CACHESETUP[DWRBUF] - If this bit is set, then for every AHB access, hit from WrBuffer is not checked. */
#define CACHESETUP_DWRBUF_Pos          (19U)
#define CACHESETUP_DWRBUF_Msk          (0x1U << CACHESETUP_DWRBUF_Pos)
#define CACHESETUP_DWRBUF                       CACHESETUP_DWRBUF_Msk

/* CACHESETUP[DLOCK] - If this bit is set, then D-cache contents are locked. Any new misses will not be replaced in D-Cache. This bit is cleared when CACHESETUP[16] is set. */
#define CACHESETUP_DLOCK_Pos           (18U)
#define CACHESETUP_DLOCK_Msk           (0x1U << CACHESETUP_DLOCK_Pos)
#define CACHESETUP_DLOCK                        CACHESETUP_DLOCK_Msk

/* CACHESETUP[DEN] - If this bit set, then D-Cache is enabled for AHB accesses. If 0, then D-cache is disabled, and all AHB accesses will be via Flash memory. This bit is cleared when CACHESETUP[16] is set. */
#define CACHESETUP_DEN_Pos             (17U)
#define CACHESETUP_DEN_Msk             (0x1U << CACHESETUP_DEN_Pos)
#define CACHESETUP_DEN                          CACHESETUP_DEN_Msk

/* CACHESETUP[DINIT] - If this bit is set then the D-cache contents are initialized to all zeros. This bit will be cleared once the initialization starts. */
#define CACHESETUP_DINIT_Pos           (16U)
#define CACHESETUP_DINIT_Msk           (0x1U << CACHESETUP_DINIT_Pos)
#define CACHESETUP_DINIT                        CACHESETUP_DINIT_Msk

/* CACHESETUP[IRDBUF] - If this bit is set, then for every AHB access, hit from Read Buffer is not checked. */
#define CACHESETUP_IRDBUF_Pos          (4U)
#define CACHESETUP_IRDBUF_Msk          (0x1U << CACHESETUP_IRDBUF_Pos)
#define CACHESETUP_IRDBUF                       CACHESETUP_IRDBUF_Msk

/* CACHESETUP[IWRBUF] - If this bit is set, then for every AHB access, hit from Write Buffer is not checked. */
#define CACHESETUP_IWRBUF_Pos          (3U)
#define CACHESETUP_IWRBUF_Msk          (0x1U << CACHESETUP_IWRBUF_Pos)
#define CACHESETUP_IWRBUF                       CACHESETUP_IWRBUF_Msk

/* CACHESETUP[ILOCK] - If this bit is set, then I-cache contents are locked. Any new misses won�t be replaced in I-Cache. This bit is cleared when CACHESETUP[0] is set. */
#define CACHESETUP_ILOCK_Pos           (2U)
#define CACHESETUP_ILOCK_Msk           (0x1U << CACHESETUP_ILOCK_Pos)
#define CACHESETUP_ILOCK                        CACHESETUP_ILOCK_Msk

/* CACHESETUP[IEN] - If this bit set, then I-Cache is enabled for AHB accesses. If 0, then I-cache is disabled, and all AHB accesses will be via Flash memory. This bit is cleared when CACHESETUP[0] is set. */
#define CACHESETUP_IEN_Pos             (1U)
#define CACHESETUP_IEN_Msk             (0x1U << CACHESETUP_IEN_Pos)
#define CACHESETUP_IEN                          CACHESETUP_IEN_Msk

