koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* CACHESETUP[IINIT] - If this bit is set then the I-cache contents are initialized to all zeros. This bit will be cleared once the initialization starts. */
#define CACHESETUP_IINIT_Pos           (0U)
#define CACHESETUP_IINIT_Msk           (0x1U << CACHESETUP_IINIT_Pos)
#define CACHESETUP_IINIT                        CACHESETUP_IINIT_Msk


/* CACHEKEY[KEY] - Cache Key register */
#define CACHEKEY_KEY_Pos               (0U)
#define CACHEKEY_KEY_Msk               (0xFFFFFFFFU << CACHEKEY_KEY_Pos)
#define CACHEKEY_KEY                   (0xF123F456U << CACHEKEY_KEY_Pos)


/* ========================================================================== */
/* ================                 GPIO                   ================== */
/* ========================================================================== */

/**
 * @brief GPIO (MMR_GPIO)
 */

typedef struct {                            // MMR_GPIO Structure
  __IOM uint16_t  GPCON;                    // GPIO Port configuration
  __IM  uint16_t  RESERVED0;
  __IOM uint8_t   GPOE;                     // GPIO Port output enable
  __IM  uint8_t   RESERVED1[3];
  __IOM uint8_t   GPPUL;                    // GPIO Port pullup enable
  __IM  uint8_t   RESERVED2[3];
  __IOM uint8_t   GPIE;                     // GPIO Port input path enable
  __IM  uint8_t   RESERVED3[3];
  __IOM uint8_t   GPIN;                     // GPIO Port registered data input
  __IM  uint8_t   RESERVED4[3];
  __IOM uint8_t   GPOUT;                    // GPIO Port data output
  __IM  uint8_t   RESERVED5[3];
  __IOM uint8_t   GPSET;                    // GPIO Port data out set
  __IM  uint8_t   RESERVED6[3];
  __IOM uint8_t   GPCLR;                    // GPIO Port data out clear
  __IM  uint8_t   RESERVED7[3];
  __IOM uint8_t   GPTGL;                    // GPIO Port pin toggle
  __IM  uint8_t   RESERVED8[3];
  __IOM uint8_t   GPODE;                    // GPIO Port open drain enable
  __IM  uint8_t   RESERVED9[3];
} MMR_GPIO_t;

/********************  Reset Value for registers  *****************************/
#define GPIO_CON_RVAL             (0U)
#define GPIO_OE_RVAL              (0U)
#define GPIO_PUL_RVAL             (0U)
#define GPIO_IE_RVAL              (0U)
#define GPIO_IN_RVAL              (0U)
#define GPIO_OUT_RVAL             (0U)
#define GPIO_SET_RVAL             (0U)
#define GPIO_CLR_RVAL             (0U)
#define GPIO_TGL_RVAL             (0U)
#define GPIO_ODE_RVAL             (0U)

/********************  Bit definition for GPCON register  *********************/
#define GPIO_CON(af, pin)         (((af) & 3U) << ((pin) << 1U))

/********************  Bit definition for GPOE register  **********************/
#define GPIO_OE(mode, pin)        (((mode) & 1U) << (pin))

/********************  Bit definition for GPPUL register  *********************/
#define GPIO_PUL(mode, pin)       (((mode) & 1U) << (pin))

/********************  Bit definition for GPIE register  **********************/
#define GPIO_IE(mode, pin)        (((mode) & 1U) << (pin))

/********************  Bit definition for GPSET register  *********************/
#define GPIO_SET(pin)             (1U << (pin))

/********************  Bit definition for GPCLR register  *********************/
#define GPIO_CLR(pin)             (1U << (pin))

/********************  Bit definition for GPTGL register  *********************/
#define GPIO_TGL(pin)             (1U << (pin))

/********************  Bit definition for GPODE register  *********************/
#define GPIO_ODE(mode, pin)       (((mode) & 1U) << (pin))


// ------------------------------------------------------------------------------------------------
// -----                                        PWM                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief PWM (MMR_PWM)
  */

typedef struct MMR_PWM {                    /*!< MMR_PWM Structure                     */
  __IO uint16_t  PWMCON0;                   /*!< PWM control register                  */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  PWMCON1;                   /*!< ADC conversion start and trip control register */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  PWMICLR;                   /*!< Hardware trip configuration register  */
  __I  uint16_t  RESERVED2[3];
  __IO uint16_t  PWM0COM0;                  /*!< Compare Register 0 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  PWM0COM1;                  /*!< Compare Register 1 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  PWM0COM2;                  /*!< Compare Register 2 for PWM0 and PWM1  */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  PWM0LEN;                   /*!< Period value register for PWM0 and PWM1 */
  __I  uint16_t  RESERVED6;
  __IO uint16_t  PWM1COM0;                  /*!< Compare Register 0 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED7;
  __IO uint16_t  PWM1COM1;                  /*!< Compare Register 1 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED8;
  __IO uint16_t  PWM1COM2;                  /*!< Compare Register 2 for PWM2 and PWM3  */
  __I  uint16_t  RESERVED9;
  __IO uint16_t  PWM1LEN;                   /*!< Period value register for PWM2 and PWM3 */
  __I  uint16_t  RESERVED10;
  __IO uint16_t  PWM2COM0;                  /*!< Compare Register 0 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED11;
  __IO uint16_t  PWM2COM1;                  /*!< Compare Register 1 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED12;
  __IO uint16_t  PWM2COM2;                  /*!< Compare Register 2 for PWM4 and PWM5  */
  __I  uint16_t  RESERVED13;
  __IO uint16_t  PWM2LEN;                   /*!< Period value register for PWM4 and PWM5 */
  __I  uint16_t  RESERVED14;
  __IO uint16_t  PWM3COM0;                  /*!< Compare Register 0 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED15;
  __IO uint16_t  PWM3COM1;                  /*!< Compare Register 1 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED16;
  __IO uint16_t  PWM3COM2;                  /*!< Compare Register 2 for PWM6 and PWM7  */
  __I  uint16_t  RESERVED17;
  __IO uint16_t  PWM3LEN;                   /*!< Period value register for PWM6 and PWM7 */
} MMR_PWM_t;

/* Reset Value for PWMCON0*/
#define PWMCON0_RVAL                   0x12 

/* PWMCON0[SYNC] - Set to enable PWM synchronization from the SYNC pin of the PWM */
#define PWMCON0_SYNC_BBA               (*(volatile unsigned long *) 0x4248003C)
#define PWMCON0_SYNC_MSK               (0x1   << 15 )
#define PWMCON0_SYNC                   (0x1   << 15 )
#define PWMCON0_SYNC_DIS               (0x0   << 15 ) /* Ignore transition from the SYNC pin */
#define PWMCON0_SYNC_EN                (0x1   << 15 ) /* All PWM counters are reset on the next clock cycle after detection of a falling edge from SYNC pin */

