koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* Reset Value for PWM0COM0*/
#define PWM0COM0_RVAL                  0x0 

/* PWM0COM0[COM0] - Compare register 0 data */
#define PWM0COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM0COM1*/
#define PWM0COM1_RVAL                  0x0 

/* PWM0COM1[COM1] - Compare register 1 data */
#define PWM0COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM0COM2*/
#define PWM0COM2_RVAL                  0x0 

/* PWM0COM2[COM2] - Compare register 2 data */
#define PWM0COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM0LEN*/
#define PWM0LEN_RVAL                   0x0 

/* PWM0LEN[LEN] - Period value */
#define PWM0LEN_LEN_MSK                (0xFFFF << 0  )

/* Reset Value for PWM1COM0*/
#define PWM1COM0_RVAL                  0x0 

/* PWM1COM0[COM0] - Compare register 0 data */
#define PWM1COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1COM1*/
#define PWM1COM1_RVAL                  0x0 

/* PWM1COM1[COM1] - Compare register 1 data */
#define PWM1COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1COM2*/
#define PWM1COM2_RVAL                  0x0 

/* PWM1COM2[COM2] - Compare register 2 data */
#define PWM1COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM1LEN*/
#define PWM1LEN_RVAL                   0x0 

/* PWM1LEN[LEN] - Period value */
#define PWM1LEN_LEN_MSK                (0xFFFF << 0  )

/* Reset Value for PWM2COM0*/
#define PWM2COM0_RVAL                  0x0 

/* PWM2COM0[COM0] - Compare register 0 data */
#define PWM2COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2COM1*/
#define PWM2COM1_RVAL                  0x0 

/* PWM2COM1[COM1] - Compare register 1 data */
#define PWM2COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2COM2*/
#define PWM2COM2_RVAL                  0x0 

/* PWM2COM2[COM2] - Compare register 2 data */
#define PWM2COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM2LEN*/
#define PWM2LEN_RVAL                   0x0 

/* PWM2LEN[LEN] - Period value */
#define PWM2LEN_LEN_MSK                (0xFFFF << 0  )

/* Reset Value for PWM3COM0*/
#define PWM3COM0_RVAL                  0x0 

/* PWM3COM0[COM0] - Compare register 0 data */
#define PWM3COM0_COM0_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3COM1*/
#define PWM3COM1_RVAL                  0x0 

/* PWM3COM1[COM1] - Compare register 1 data */
#define PWM3COM1_COM1_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3COM2*/
#define PWM3COM2_RVAL                  0x0 

/* PWM3COM2[COM2] - Compare register 2 data */
#define PWM3COM2_COM2_MSK              (0xFFFF << 0  )

/* Reset Value for PWM3LEN*/
#define PWM3LEN_RVAL                   0x0 

/* PWM3LEN[LEN] - Period value */
#define PWM3LEN_LEN_MSK                (0xFFFF << 0  )


/* ========================================================================== */
/* ================                  CLKCTL                ================== */
/* ========================================================================== */

/**
  * @brief clocking (MMR_CLKCTL)
  */

typedef struct MMR_CLKCTL {           /*!< MMR_CLKCTL Structure               */
  __IOM uint16_t  CLKCON0;            /*!< Misc clock settings register       */
  __IM  uint16_t  RESERVED0;
  __IOM uint16_t  CLKCON1;            /*!< Clock dividers register            */
  __IM  uint16_t  RESERVED1[7];
  __IOM uint16_t  CLKCON5;            /*!< User clock gating control register */
  __IM  uint16_t  RESERVED2;
  __IOM uint16_t  CLKSTAT0;           /*!< Clocking status                    */
  __IM  uint16_t  RESERVED3;
} MMR_CLKCTL_t;

/* CLKCON0[HFXTALIE] - High frequency crystal interrupt enable */
#define CLKCON0_HFXTALIE_Pos          (15U)
#define CLKCON0_HFXTALIE_Msk          (0x1U << CLKCON0_HFXTALIE_Pos)
#define CLKCON0_HFXTALIE_DIS          (0x0U << CLKCON0_HFXTALIE_Pos)            /* An interrupt to the core will not be generated on a HFXTAL ok or HFXTAL nok */
#define CLKCON0_HFXTALIE_EN           (0x1U << CLKCON0_HFXTALIE_Pos)            /* An interrupt to the core will be generated on a HFXTAL ok or HFXTAL nok     */

/* CLKCON0[SPLLIE] - SPLL Interrupt enable */
#define CLKCON0_SPLLIE_Pos            (13U)
#define CLKCON0_SPLLIE_Msk            (0x1U << CLKCON0_SPLLIE_Pos)
#define CLKCON0_SPLLIE_DIS            (0x0U << CLKCON0_SPLLIE_Pos)              /* System PLL interrupt will not be generated */
#define CLKCON0_SPLLIE_EN             (0x1U << CLKCON0_SPLLIE_Pos)              /* System PLL interrupt will be generated     */

/* CLKCON0[PLLMUX] - PLL source selection */
#define CLKCON0_PLLMUX_Pos            (11U)
#define CLKCON0_PLLMUX_Msk            (0x1U << CLKCON0_PLLMUX_Pos)
#define CLKCON0_PLLMUX_HFOSC          (0x0U << CLKCON0_PLLMUX_Pos)              /* Internal oscillator is selected (HFOSC)  */
#define CLKCON0_PLLMUX_HFXTAL         (0x1U << CLKCON0_PLLMUX_Pos)              /* External oscillator is selected (HFXTAL) */

/* CLKCON0[CLKOUT] - GPIO clk out select */
#define CLKCON0_CLKOUT_Pos            (4U)
#define CLKCON0_CLKOUT_Msk            (0xFU << CLKCON0_CLKOUT_Pos)
#define CLKCON0_CLKOUT_ROOT           (0x0U << CLKCON0_CLKOUT_Pos)              /* Root Clock               */
#define CLKCON0_CLKOUT_LFOSC          (0x1U << CLKCON0_CLKOUT_Pos)              /* LFOSC (32 kHz)           */
#define CLKCON0_CLKOUT_HFOSC          (0x2U << CLKCON0_CLKOUT_Pos)              /* HFOSC (16 MHz)           */
#define CLKCON0_CLKOUT_CORE           (0x4U << CLKCON0_CLKOUT_Pos)              /* Core Clock               */
#define CLKCON0_CLKOUT_PCLK           (0x5U << CLKCON0_CLKOUT_Pos)              /* PCLK                     */
#define CLKCON0_CLKOUT_T0             (0xBU << CLKCON0_CLKOUT_Pos)              /* Timer 0 Clock            */
#define CLKCON0_CLKOUT_WUT            (0xCU << CLKCON0_CLKOUT_Pos)              /* Wake up Timer Clock      */
#define CLKCON0_CLKOUT_HFXTAL         (0xEU << CLKCON0_CLKOUT_Pos)              /* HFXTAL                   */

/* CLKCON0[CLKMUX] - Clock mux select */
#define CLKCON0_CLKMUX_Pos            (0U)
#define CLKCON0_CLKMUX_Msk            (0x3U << CLKCON0_CLKMUX_Pos)
#define CLKCON0_CLKMUX_HFOSC          (0x0U << CLKCON0_CLKMUX_Pos)              /* High frequency internal oscillator (HFOSC) */
#define CLKCON0_CLKMUX_SPLL           (0x1U << CLKCON0_CLKMUX_Pos)              /* System PLL is selected (80 MHz)            */
#define CLKCON0_CLKMUX_EXTCLK         (0x3U << CLKCON0_CLKMUX_Pos)              /* External GPIO port is selected (ECLKIN)    */

