koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* CLKCON1[CDD2DCLK] - D2DCLK divide bits */
#define CLKCON1_CDD2DCLK_Pos          (11U)
#define CLKCON1_CDD2DCLK_Msk          (0x1U << CLKCON1_CDD2DCLK_Pos)
#define CLKCON1_CDD2DCLK_DIV1         (0x0U << CLKCON1_CDD2DCLK_Pos)            /* D2D_CLK frequency = HCLK frequency */
#define CLKCON1_CDD2DCLK_DIV2         (0x1U << CLKCON1_CDD2DCLK_Pos)            /* D2D_CLK frequency = half of HCLK frequency */

/* CLKCON1[CDPCLK] - PCLK divide bits */
#define CLKCON1_CDPCLK_Pos            (8U)
#define CLKCON1_CDPCLK_Msk            (0x7U << CLKCON1_CDPCLK_Pos)
#define CLKCON1_CDPCLK_DIV4           (0x2U << CLKCON1_CDPCLK_Pos)              /* DIV4. Divide by 4        */
#define CLKCON1_CDPCLK_DIV8           (0x3U << CLKCON1_CDPCLK_Pos)              /* DIV8. Divide by 8        */
#define CLKCON1_CDPCLK_DIV16          (0x4U << CLKCON1_CDPCLK_Pos)              /* DIV16. Divide by 16      */
#define CLKCON1_CDPCLK_DIV32          (0x5U << CLKCON1_CDPCLK_Pos)              /* DIV32. Divide by 32      */
#define CLKCON1_CDPCLK_DIV64          (0x6U << CLKCON1_CDPCLK_Pos)              /* DIV64. Divide by 64      */
#define CLKCON1_CDPCLK_DIV128         (0x7U << CLKCON1_CDPCLK_Pos)              /* DIV128. Divide by 128    */

/* CLKCON1[CDHCLK] - HCLK divide bits */
#define CLKCON1_CDHCLK_Pos            (0U)
#define CLKCON1_CDHCLK_Msk            (0x7U << CLKCON1_CDHCLK_Pos)
#define CLKCON1_CDHCLK_DIV1           (0x0U << CLKCON1_CDHCLK_Pos)              /* DIV1. Divide by 1        */
#define CLKCON1_CDHCLK_DIV2           (0x1U << CLKCON1_CDHCLK_Pos)              /* DIV2. Divide by 2        */
#define CLKCON1_CDHCLK_DIV4           (0x2U << CLKCON1_CDHCLK_Pos)              /* DIV4. Divide by 4        */
#define CLKCON1_CDHCLK_DIV8           (0x3U << CLKCON1_CDHCLK_Pos)              /* DIV8. Divide by 8        */
#define CLKCON1_CDHCLK_DIV16          (0x4U << CLKCON1_CDHCLK_Pos)              /* DIV16.Divide by 16       */
#define CLKCON1_CDHCLK_DIV32          (0x5U << CLKCON1_CDHCLK_Pos)              /* DIV32.Divide by 32       */
#define CLKCON1_CDHCLK_DIV64          (0x6U << CLKCON1_CDHCLK_Pos)              /* DIV64.Divide by 64       */
#define CLKCON1_CDHCLK_DIV128         (0x7U << CLKCON1_CDHCLK_Pos)              /* DIV128. Divide by 128    */

/* CLKCON5[UCLKUARTOFF] - UART clock user control */
#define CLKCON5_UCLKUARTOFF_Pos       (5U)
#define CLKCON5_UCLKUARTOFF_Msk       (0x1U << CLKCON5_UCLKUARTOFF_Pos)
#define CLKCON5_UCLKUARTOFF_ON        (0x0U << CLKCON5_UCLKUARTOFF_Pos)         /* Clock on                 */
#define CLKCON5_UCLKUARTOFF_OFF       (0x1U << CLKCON5_UCLKUARTOFF_Pos)         /* Clock off                */

/* CLKCON5[UCLKI2C1OFF] - I2C1 clock user control */
#define CLKCON5_UCLKI2C1OFF_Pos       (4U)
#define CLKCON5_UCLKI2C1OFF_Msk       (0x1U << CLKCON5_UCLKI2C1OFF_Pos)
#define CLKCON5_UCLKI2C1OFF_ON        (0x0U << CLKCON5_UCLKI2C1OFF_Pos)         /* Clock on                 */
#define CLKCON5_UCLKI2C1OFF_OFF       (0x1U << CLKCON5_UCLKI2C1OFF_Pos)         /* Clock off                */

/* CLKCON5[UCLKI2C0OFF] - I2C0 clock user control */
#define CLKCON5_UCLKI2C0OFF_Pos       (3U)
#define CLKCON5_UCLKI2C0OFF_Msk       (0x1U << CLKCON5_UCLKI2C0OFF_Pos)
#define CLKCON5_UCLKI2C0OFF_ON        (0x0U << CLKCON5_UCLKI2C0OFF_Pos)         /* Clock on                 */
#define CLKCON5_UCLKI2C0OFF_OFF       (0x1U << CLKCON5_UCLKI2C0OFF_Pos)         /* Clock off                */

/* CLKCON5[UCLKSPI1OFF] - SPI1 clock user control */
#define CLKCON5_UCLKSPI1OFF_Pos       (1U)
#define CLKCON5_UCLKSPI1OFF_Msk       (0x1U << CLKCON5_UCLKSPI1OFF_Pos)
#define CLKCON5_UCLKSPI1OFF_ON        (0x0U << CLKCON5_UCLKSPI1OFF_Pos)         /* Clock on                 */
#define CLKCON5_UCLKSPI1OFF_OFF       (0x1U << CLKCON5_UCLKSPI1OFF_Pos)         /* Clock off                */

/* CLKCON5[UCLKSPI0OFF] - SPI0 clock user control */
#define CLKCON5_UCLKSPI0OFF_Pos       (1U)
#define CLKCON5_UCLKSPI0OFF_Msk       (0x1U << CLKCON5_UCLKSPI0OFF_Pos)
#define CLKCON5_UCLKSPI0OFF_ON        (0x0U << CLKCON5_UCLKSPI0OFF_Pos)         /* Clock on                 */
#define CLKCON5_UCLKSPI0OFF_OFF       (0x1U << CLKCON5_UCLKSPI0OFF_Pos)         /* Clock off                */

/* CLKSTAT0[HFXTALNOK] - HF crystal not stable */
#define CLKSTAT0_HFXTALNOK_Pos        (14U)
#define CLKSTAT0_HFXTALNOK_Msk        (0x1U << CLKSTAT0_HFXTALNOK_Pos)
#define CLKSTAT0_HFXTALNOK            CLKSTAT0_HFXTALNOK_Msk

/* CLKSTAT0[HFXTALOK] - HF crystal stable */
#define CLKSTAT0_HFXTALOK_Pos         (13U)
#define CLKSTAT0_HFXTALOK_Msk         (0x1U << CLKSTAT0_HFXTALOK_Pos)
#define CLKSTAT0_HFXTALOK             CLKSTAT0_HFXTALOK_Msk

/* CLKSTAT0[HFXTALSTATUS] - HF crystal status */
#define CLKSTAT0_HFXTALSTATUS_Pos     (12U)
#define CLKSTAT0_HFXTALSTATUS_Msk     (0x1U << CLKSTAT0_HFXTALSTATUS_Pos)
#define CLKSTAT0_HFXTALSTATUS         CLKSTAT0_HFXTALSTATUS_Msk

/* CLKSTAT0[SPLLUNLOCK] - System PLL unlock */
#define CLKSTAT0_SPLLUNLOCK_Pos       (2U)
#define CLKSTAT0_SPLLUNLOCK_Msk       (0x1U << CLKSTAT0_SPLLUNLOCK_Pos)
#define CLKSTAT0_SPLLUNLOCK           CLKSTAT0_SPLLUNLOCK_Msk

/* CLKSTAT0[SPLLLOCK] - System PLL lock */
#define CLKSTAT0_SPLLLOCK_Pos         (1U)
#define CLKSTAT0_SPLLLOCK_Msk         (0x1U << CLKSTAT0_SPLLLOCK_Pos)
#define CLKSTAT0_SPLLLOCK             CLKSTAT0_SPLLLOCK_Msk

/* CLKSTAT0[SPLLSTATUS] - System PLL status */
#define CLKSTAT0_SPLLSTATUS_Pos       (0U)
#define CLKSTAT0_SPLLSTATUS_Msk       (0x1U << CLKSTAT0_SPLLSTATUS_Pos)
#define CLKSTAT0_SPLLSTATUS           CLKSTAT0_SPLLSTATUS_Msk


/* ========================================================================== */
/* ================                  DMACTL                ================== */
/* ========================================================================== */

/**
  * @brief DMACTL (MMR_DMACTL)
  */

typedef struct MMR_DMACTL {                 /*!< MMR_DMACTL Structure                  */
  __IO uint16_t  GPFDMACTL;                 /*!< DMA Channel Control                   */
  __I  uint16_t  RESERVED0;
  __IO uint32_t  L1SRAMCTL;                 /*!< L1SRAMCTL                             */
} MMR_DMACTL_t;

/* Reset Value for GPFDMACTL*/
#define GPFDMACTL_RVAL                 0x0 

/* GPFDMACTL[GPFlash] - DMA Channel 13 Control */
#define GPFDMACTL_GPFlash_BBA          (*(volatile unsigned long *) 0x42502000)
#define GPFDMACTL_GPFlash_MSK          (0x1   << 0  )
#define GPFDMACTL_GPFlash              (0x1   << 0  )

/* Reset Value for L1SRAMCTL*/
#define L1SRAMCTL_RVAL                 0x0 

/* L1SRAMCTL[L1SRAMCTL] -  */
#define L1SRAMCTL_L1SRAMCTL_BBA        (*(volatile unsigned long *) 0x42502080)
#define L1SRAMCTL_L1SRAMCTL_MSK        (0x1   << 0  )
#define L1SRAMCTL_L1SRAMCTL            (0x1   << 0  )
#define L1SRAMCTL_L1SRAMCTL_DIS        (0x0   << 0  )
#define L1SRAMCTL_L1SRAMCTL_EN         (0x1   << 0  )


/* ========================================================================== */
/* ================                   SPI                  ================== */
/* ========================================================================== */

/**
  * @brief SPI (MMR_SPI)
  */

typedef struct MMR_SPI {                    /*!< MMR_SPI Structure            */
  __IO uint16_t  SPISTA;                    /*!< Status register              */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  SPIRX;                     /*!< Receive register             */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  SPITX;                     /*!< Transmit register            */
  __I  uint16_t  RESERVED2;
  __IO uint16_t  SPIDIV;                    /*!< Baud rate selection register */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  SPICON;                    /*!< SPI configuration register   */
  __I  uint16_t  RESERVED4;
  __IO uint16_t  SPIDMA;                    /*!< SPI DMA enable register      */
  __I  uint16_t  RESERVED5;
  __IO uint16_t  SPICNT;                    /*!< Transfer byte count register */
} MMR_SPI_t;

/* SPISTA[CSRSG] - Detected a rising edge on CS, in CONT mode */
#define SPISTA_CSRSG_MSK               (0x1   << 14 )
#define SPISTA_CSRSG                   (0x1   << 14 )
#define SPISTA_CSRSG_CLR               (0x0   << 14 ) /* Cleared to 0 when the Status register is read. */
#define SPISTA_CSRSG_SET               (0x1   << 14 ) /* Set to 1 when there was a rising edge in CS line, when the device was in master mode, continuous transfer, High Frequency mode and CSIRQ_EN was asserted. */

