koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* SPICON[CPOL] - Serial Clock Polarity */
#define SPICON_CPOL_MSK                (0x1   << 3  )
#define SPICON_CPOL                    (0x1   << 3  )
#define SPICON_CPOL_LOW                (0x0   << 3  ) /* Serial clock idles low   */
#define SPICON_CPOL_HIGH               (0x1   << 3  ) /* Serial clock idles high  */

/* SPICON[CPHA] - Serial clock phase mode */
#define SPICON_CPHA_MSK                (0x1   << 2  )
#define SPICON_CPHA                    (0x1   << 2  )
#define SPICON_CPHA_SAMPLETRAILING     (0x1   << 2  ) /* Serial clock pulses at the beginning of each serial bit transfer */
#define SPICON_CPHA_SAMPLELEADING      (0x0   << 2  ) /* Serial clock pulses at the end of each serial bit transfer */

/* SPICON[MASEN] - Master mode enable */
#define SPICON_MASEN_MSK               (0x1   << 1  )
#define SPICON_MASEN                   (0x1   << 1  )
#define SPICON_MASEN_DIS               (0x0   << 1  ) /* Enable slave mode        */
#define SPICON_MASEN_EN                (0x1   << 1  ) /* Enable master mode       */

/* SPICON[ENABLE] - SPI enable */
#define SPICON_ENABLE_MSK              (0x1   << 0  )
#define SPICON_ENABLE                  (0x1   << 0  )
#define SPICON_ENABLE_DIS              (0x0   << 0  ) /* Disable the SPI          */
#define SPICON_ENABLE_EN               (0x1   << 0  ) /* Enable the SPI           */

/* SPIDMA[IENRXDMA] - Enable receive DMA request */
#define SPIDMA_IENRXDMA_MSK            (0x1   << 2  )
#define SPIDMA_IENRXDMA                (0x1   << 2  )
#define SPIDMA_IENRXDMA_DIS            (0x0   << 2  ) /* Disable RX DMA Interrupt */
#define SPIDMA_IENRXDMA_EN             (0x1   << 2  ) /* Enable RX DMA Interrupt  */

/* SPIDMA[IENTXDMA] - Enable transmit DMA request */
#define SPIDMA_IENTXDMA_MSK            (0x1   << 1  )
#define SPIDMA_IENTXDMA                (0x1   << 1  )
#define SPIDMA_IENTXDMA_DIS            (0x0   << 1  ) /* Disable TX DMA Interrupt */
#define SPIDMA_IENTXDMA_EN             (0x1   << 1  ) /* Enable TX DMA Interrupt  */

/* SPIDMA[ENABLE] - Enable DMA for data transfer */
#define SPIDMA_ENABLE_MSK              (0x1   << 0  )
#define SPIDMA_ENABLE                  (0x1   << 0  )
#define SPIDMA_ENABLE_DIS              (0x0   << 0  )
#define SPIDMA_ENABLE_EN               (0x1   << 0  )

/* SPICNT[COUNT] - Transfer byte count */
#define SPICNT_COUNT_MSK               (0xFF  << 0  )


/* ========================================================================== */
/* ================                   ADC                  ================== */
/* ========================================================================== */

/**
  * @brief ADC (MMR_ADC)
  */

typedef struct MMR_ADC {                    /*!< MMR_ADC Structure                     */
  __IO uint16_t  ADCCON;                    /*!< ADC Configuration                     */
  __I  uint16_t  RESERVED0[8005];
  __IO uint32_t  ADCDAT[28];                /*!< ADCx Data and flags                   */
  __I  uint32_t  RESERVED1[4];
  __IO uint16_t  ADCCHA;                    /*!< ADC Channel Select                    */
  __I  uint16_t  RESERVED2[3];
  __IO uint32_t  ADCSEQ;                    /*!< ADC Sequencer Control                 */
  __IO uint32_t  ADCSEQC;                   /*!< ADC Sequencer Configuration           */
  __IO uint16_t  ADCGN;                     /*!< User gain adjust                      */
  __I  uint16_t  RESERVED3;
  __IO uint16_t  ADCOF;                     /*!< User offset adjust                    */
  __I  uint16_t  RESERVED4;
  __IO uint32_t  ADCCMP;                    /*!< Digital comparator configuration      */
  __IO uint32_t  ADCCNVC;                   /*!< ADC conversion  configuration         */
} MMR_ADC_t;

/* Reset Value for ADCCON*/
#define ADCCON_RVAL                    0x280 

/* ADCCON[SOFT_RESET] - software reset ADC */
#define ADCCON_SOFT_RESET_Pos           10
#define ADCCON_SOFT_RESET_Msk          (0x1 << ADCCON_SOFT_RESET_Pos)
#define ADCCON_SOFT_RESET              (0x1 << ADCCON_SOFT_RESET_Pos)

/* ADCCON[PUP] - ADC power up */
#define ADCCON_PUP_BBA                 (*(volatile unsigned long *) 0x43042EA4)
#define ADCCON_PUP_MSK                 (0x1   << 9  )
#define ADCCON_PUP                     (0x1   << 9  )

/* ADCCON[REFB_PUP] - ADC reference buffer power up */
#define ADCCON_REFB_PUP_BBA            (*(volatile unsigned long *) 0x43042E9C)
#define ADCCON_REFB_PUP_MSK            (0x1   << 7  )
#define ADCCON_REFB_PUP                (0x1   << 7  )

/* ADCCON[Restart_ADC] - Restart ADC, reset Analog Part of ADC */
#define ADCCON_Restart_ADC_BBA         (*(volatile unsigned long *) 0x43042E98)
#define ADCCON_Restart_ADC_MSK         (0x1   << 6  )
#define ADCCON_Restart_ADC             (0x1   << 6  )

/* ADCCON[SEQ_DMA] - DMA request enable for ADC sequence conversion */
#define ADCCON_SEQ_DMA_BBA             (*(volatile unsigned long *) 0x43042E90)
#define ADCCON_SEQ_DMA_MSK             (0x1   << 4  )
#define ADCCON_SEQ_DMA                 (0x1   << 4  )

/* ADCCON[CNV_DMA] - DMA request enable for ADC non-sequence conversion */
#define ADCCON_CNV_DMA_BBA             (*(volatile unsigned long *) 0x43042E8C)
#define ADCCON_CNV_DMA_MSK             (0x1   << 3  )
#define ADCCON_CNV_DMA                 (0x1   << 3  )

/* ADCCON[C_TYPE] - ADC conversion type */
#define ADCCON_C_TYPE_Pos               0
#define ADCCON_C_TYPE_Msk              (0x7   << ADCCON_C_TYPE_Pos)
#define ADCCON_C_TYPE_NO               (0x0   << ADCCON_C_TYPE_Pos)             /* No conversion            */
#define ADCCON_C_TYPE_DIO              (0x1   << ADCCON_C_TYPE_Pos)             /* DIO pin starts conversion (P2.4) */
#define ADCCON_C_TYPE_SINGLE           (0x2   << ADCCON_C_TYPE_Pos)             /* Single conversion        */
#define ADCCON_C_TYPE_CONT             (0x3   << ADCCON_C_TYPE_Pos)             /* Continuous conversion (use this mode for the sequencer) */
#define ADCCON_C_TYPE_PLA              (0x4   << ADCCON_C_TYPE_Pos)             /* PLA conversion           */

/* Reset Value for ADCDAT*/
#define ADCDAT_RVAL                    0x0 

/* ADCDAT[DAT] - ADCx data */
#define ADCDAT_DAT_Pos                  12
#define ADCDAT_DAT_Msk                 (0xFFFFF << ADCDAT_DAT_Pos)

/* ADCDAT[VALID] - Flag indicating if data is valid. */
#define ADCDAT_VALID_BBA               (*(volatile unsigned long *) 0x430C000C)
#define ADCDAT_VALID_MSK               (0x1   << 3  )
#define ADCDAT_VALID                   (0x1   << 3  )
#define ADCDAT_VALID_CLR               (0x0   << 3  ) /* Data is Invalid          */
#define ADCDAT_VALID_SET               (0x1   << 3  ) /* Data is Valid            */

