koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* ADCDAT[OLD] - Flag data has already been read. */
#define ADCDAT_OLD_BBA                 (*(volatile unsigned long *) 0x430C0008)
#define ADCDAT_OLD_MSK                 (0x1   << 2  )
#define ADCDAT_OLD                     (0x1   << 2  )
#define ADCDAT_OLD_CLR                 (0x0   << 2  ) /* Last data has not been read */
#define ADCDAT_OLD_SET                 (0x1   << 2  ) /* Last data already read   */

/* Reset Value for ADCCHA*/
#define ADCCHA_RVAL                    0x111F 

/* ADCCHA[ADCCN] - Selects channel for ADC negative input */
#define ADCCHA_ADCCN_Pos                8
#define ADCCHA_ADCCN_Msk               (0x1F  << ADCCHA_ADCCN_Pos)
#define ADCCHA_ADCCN_AIN0              (0x0   << ADCCHA_ADCCN_Pos)              /* AIN0                     */
#define ADCCHA_ADCCN_AIN1              (0x1   << ADCCHA_ADCCN_Pos)              /* AIN1                     */
#define ADCCHA_ADCCN_AIN2              (0x2   << ADCCHA_ADCCN_Pos)              /* AIN2                     */
#define ADCCHA_ADCCN_AIN3              (0x3   << ADCCHA_ADCCN_Pos)              /* AIN3                     */
#define ADCCHA_ADCCN_AIN4              (0x4   << ADCCHA_ADCCN_Pos)              /* AIN4                     */
#define ADCCHA_ADCCN_AIN5              (0x5   << ADCCHA_ADCCN_Pos)              /* AIN5                     */
#define ADCCHA_ADCCN_AIN6              (0x6   << ADCCHA_ADCCN_Pos)              /* AIN6                     */
#define ADCCHA_ADCCN_AIN7              (0x7   << ADCCHA_ADCCN_Pos)              /* AIN7                     */
#define ADCCHA_ADCCN_AIN8              (0x8   << ADCCHA_ADCCN_Pos)              /* AIN8                     */
#define ADCCHA_ADCCN_AIN9              (0x9   << ADCCHA_ADCCN_Pos)              /* AIN9                     */
#define ADCCHA_ADCCN_AIN10             (0xA   << ADCCHA_ADCCN_Pos)              /* AIN10                    */
#define ADCCHA_ADCCN_AIN11             (0xB   << ADCCHA_ADCCN_Pos)              /* AIN11                    */
#define ADCCHA_ADCCN_AIN12             (0xC   << ADCCHA_ADCCN_Pos)              /* AIN12                    */
#define ADCCHA_ADCCN_AIN13             (0xD   << ADCCHA_ADCCN_Pos)              /* AIN13                    */
#define ADCCHA_ADCCN_AIN14             (0xE   << ADCCHA_ADCCN_Pos)              /* AIN14                    */
#define ADCCHA_ADCCN_AIN15             (0xF   << ADCCHA_ADCCN_Pos)              /* AIN15                    */
#define ADCCHA_ADCCN_VREFP_NADC        (0x10  << ADCCHA_ADCCN_Pos)              /* VREFP_NADC: Connect ADC_REFP to negative input. */
#define ADCCHA_ADCCN_VREFN_NADC        (0x11  << ADCCHA_ADCCN_Pos)              /* VREFN_NADC: Connect ADC_REFN to negative input. Use This setting for single ended measurements. */
#define ADCCHA_ADCCN_AGND              (0x12  << ADCCHA_ADCCN_Pos)              /* AGND                     */
#define ADCCHA_ADCCN_PGND              (0x13  << ADCCHA_ADCCN_Pos)              /* PGND                     */

/* ADCCHA[ADCCP] - Select ADC channel */
#define ADCCHA_ADCCP_Pos                0
#define ADCCHA_ADCCP_Msk               (0x1F  << ADCCHA_ADCCP_Pos)
#define ADCCHA_ADCCP_AIN0              (0x0   << ADCCHA_ADCCP_Pos)              /* AIN0                     */
#define ADCCHA_ADCCP_AIN1              (0x1   << ADCCHA_ADCCP_Pos)              /* AIN1                     */
#define ADCCHA_ADCCP_AIN2              (0x2   << ADCCHA_ADCCP_Pos)              /* AIN2                     */
#define ADCCHA_ADCCP_AIN3              (0x3   << ADCCHA_ADCCP_Pos)              /* AIN3                     */
#define ADCCHA_ADCCP_AIN4              (0x4   << ADCCHA_ADCCP_Pos)              /* AIN4                     */
#define ADCCHA_ADCCP_AIN5              (0x5   << ADCCHA_ADCCP_Pos)              /* AIN5                     */
#define ADCCHA_ADCCP_AIN6              (0x6   << ADCCHA_ADCCP_Pos)              /* AIN6                     */
#define ADCCHA_ADCCP_AIN7              (0x7   << ADCCHA_ADCCP_Pos)              /* AIN7                     */
#define ADCCHA_ADCCP_AIN8              (0x8   << ADCCHA_ADCCP_Pos)              /* AIN8                     */
#define ADCCHA_ADCCP_AIN9              (0x9   << ADCCHA_ADCCP_Pos)              /* AIN9                     */
#define ADCCHA_ADCCP_AIN10             (0xA   << ADCCHA_ADCCP_Pos)              /* AIN10                    */
#define ADCCHA_ADCCP_AIN11             (0xB   << ADCCHA_ADCCP_Pos)              /* AIN11                    */
#define ADCCHA_ADCCP_AIN12             (0xC   << ADCCHA_ADCCP_Pos)              /* AIN12                    */
#define ADCCHA_ADCCP_AIN13             (0xD   << ADCCHA_ADCCP_Pos)              /* AIN13                    */
#define ADCCHA_ADCCP_AIN14             (0xE   << ADCCHA_ADCCP_Pos)              /* AIN14                    */
#define ADCCHA_ADCCP_AIN15             (0xF   << ADCCHA_ADCCP_Pos)              /* AIN15                    */
#define ADCCHA_ADCCP_TEMP_SENSOR       (0x16  << ADCCHA_ADCCP_Pos)              /* TEMP_SENSOR              */
#define ADCCHA_ADCCP_VREFP_PADC        (0x17  << ADCCHA_ADCCP_Pos)              /* VREFP_PADC: Connect ADC_REFP to positive input. Note: This pin should not be measured relative to AGND. This selection is intended for measuring the differential voltage between the negative input and ADC_REFP. */
#define ADCCHA_ADCCP_PVDD_IDAC2        (0x18  << ADCCHA_ADCCP_Pos)              /* PVDD_IDAC2: Use this to measure the PVDD supply voltage for IDAC2 */
#define ADCCHA_ADCCP_IOVDD_2           (0x19  << ADCCHA_ADCCP_Pos)              /* IOVDD_2: Use this to measure half of the IOVDD supply voltage */
#define ADCCHA_ADCCP_AVDD_2            (0x1A  << ADCCHA_ADCCP_Pos)              /* AVDD_2: Use this to measure half of the AVDD supply voltage. */
#define ADCCHA_ADCCP_VREFN_PADC        (0x1B  << ADCCHA_ADCCP_Pos)              /* VREFN_PADC: Connect ADC_REFN to positive input. */

/* Reset Value for ADCSEQ*/
#define ADCSEQ_RVAL                    0x0 

/* ADCSEQ[ST] - Sequence restart, used to force sequence to start at first channel when sequence is working */
#define ADCSEQ_ST_BBA                  (*(volatile unsigned long *) 0x430C117C)
#define ADCSEQ_ST_MSK                  (0x1   << 31 )
#define ADCSEQ_ST                      (0x1   << 31 )

/* ADCSEQ[EN] - Sequence enable */
#define ADCSEQ_EN_BBA                  (*(volatile unsigned long *) 0x430C1178)
#define ADCSEQ_EN_MSK                  (0x1   << 30 )
#define ADCSEQ_EN                      (0x1   << 30 )

/* ADCSEQ[CH] - Select channels included in sequence operation. */
#define ADCSEQ_CH_MSK                  (0x1FFFFFFF << 0  )

