koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* Reset Value for ADCSEQC*/
#define ADCSEQC_RVAL                   0x8C631 

/* ADCSEQC[T] - Define programmable delay of 0 to 254 between sequences. A delay 255 will cause a halt after one sequence. */
#define ADCSEQC_T_Pos                   20
#define ADCSEQC_T_Msk                  (0xFF  << ADCSEQC_T_Pos)

/* ADCSEQC[DIF6] - Selects differential mode negative input for AIN6 in the sequence. */
#define ADCSEQC_DIF6_MSK               (0x1F  << 15 )

/* ADCSEQC[DIF4] - Selects differential mode negative input for AIN4 in the sequence. */
#define ADCSEQC_DIF4_MSK               (0x1F  << 10 )

/* ADCSEQC[DIF2] - Selects differential mode negative input for AIN2 in the sequence. */
#define ADCSEQC_DIF2_MSK               (0x1F  << 5  )

/* ADCSEQC[DIF0] - Selects differential mode negative input for AIN0 in the sequence. */
#define ADCSEQC_DIF0_MSK               (0x1F  << 0  )

/* Reset Value for ADCGN*/
#define ADCGN_RVAL                     0x2000 

/* ADCGN[GN] - User gain register */
#define ADCGN_GN_MSK                   (0x3FFF << 0  )

/* Reset Value for ADCOF*/
#define ADCOF_RVAL                     0x2000 

/* ADCOF[OF] - User offset register */
#define ADCOF_OF_MSK                   (0x3FFF << 0  )

/* Reset Value for ADCCMP*/
#define ADCCMP_RVAL                    0x0 

/* ADCCMP[THR] - Digital compare threshold */
#define ADCCMP_THR_MSK                 (0xFFFF << 2  )

/* ADCCMP[DIR] - Select digital comparator direction */
#define ADCCMP_DIR_BBA                 (*(volatile unsigned long *) 0x430C1304)
#define ADCCMP_DIR_MSK                 (0x1   << 1  )
#define ADCCMP_DIR                     (0x1   << 1  )
#define ADCCMP_DIR_DIS                 (0x0   << 1  ) /* ADCTH less than channel 4 data */
#define ADCCMP_DIR_EN                  (0x1   << 1  ) /* ADCTH larger than channel 4 data */

/* ADCCMP[EN] - Digital comparator enable */
#define ADCCMP_EN_BBA                  (*(volatile unsigned long *) 0x430C1300)
#define ADCCMP_EN_MSK                  (0x1   << 0  )
#define ADCCMP_EN                      (0x1   << 0  )
#define ADCCMP_EN_DIS                  (0x0   << 0  ) /* Disable                  */
#define ADCCMP_EN_EN                   (0x1   << 0  ) /* Enable                   */

/* Reset Value for ADCCNVC*/
#define ADCCNVC_RVAL                   0xA00C8 

/* ADCCNVC[CNVD] - Configure ADC Acquisition time and sampling time */
#define ADCCNVC_CNVD_Pos                16
#define ADCCNVC_CNVD_Msk               (0x3FF << ADCCNVC_CNVD_Pos)

/* ADCCNVC[CNVC] - Configure Conversion frequency */
#define ADCCNVC_CNVC_Pos                0
#define ADCCNVC_CNVC_Msk               (0x3FF << ADCCNVC_CNVC_Pos)


/* ========================================================================== */
/* ================                 VDAC                   ================== */
/* ========================================================================== */

/**
 * @brief VDAC (MMR_VDAC)
 */

typedef struct MMR_VDAC {                   /*!< MMR_VDAC Structure           */
  __IO uint16_t  DACCON;                    /*!< DAC control register         */
  __I  uint16_t  RESERVED0[8193];
  __IO uint32_t  DACDAT;                    /*!< DAC data register            */
} MMR_VDAC_t;

/********************  Bit definition for DACCON register  ********************/
#define DACCON_RN_Pos                 (0U)
#define DACCON_RN_Msk                 (0x3U << DACCON_RN_Pos)
#define DACCON_RN_IREF                (0x0U << DACCON_RN_Pos)
#define DACCON_RN_AVDD                (0x3U << DACCON_RN_Pos)

#define DACCON_EN_Pos                 (4U)
#define DACCON_EN_Msk                 (0x1U << DACCON_EN_Pos)
#define DACCON_EN                              DACCON_EN_Msk

#define DACCON_PD_Pos                 (8U)
#define DACCON_PD_Msk                 (0x1U << DACCON_PD_Pos)
#define DACCON_PD                              DACCON_PD_Msk

/********************  Bit definition for DACDAT register  ********************/
#define DACDAT_DAT_Pos                (16U)
#define DACDAT_DAT_Msk                (0xFFFU << DACDAT_DAT_Pos)
#define DACDAT_DAT(n)                 (((n) << DACDAT_DAT_Pos) & DACDAT_DAT_Msk)


/* ========================================================================== */
/* ================                 InBuf                  ================== */
/* ========================================================================== */

/**
  * @brief InBuf (MMR_InBuf)
  */

typedef struct MMR_INBUF {                  /*!< MMR_InBuf Structure                   */
  __IO uint16_t  IBUFCON;                   /*!< InBuf control register                */
} MMR_INBUF_t;

/* Reset Value for IBUFCON*/
#define IBUFCON_RVAL                   0xF 

/* IBUFCON[IBUF_CHOP] - CHOPINBUF enable the chop per InBuf separately */
#define IBUFCON_IBUF_CHOP_MSK          (0x3   << 4  )
#define IBUFCON_IBUF_CHOP_OFF          (0x0   << 4  ) /* Chopping disabled on both buffers. */
#define IBUFCON_IBUF_CHOP_NSIDE        (0x1   << 4  ) /* Chopping enabled on N-side only. P-side Disabled. */
#define IBUFCON_IBUF_CHOP_PSIDE        (0x2   << 4  ) /* Chopping enabled on P-side only. N-side Disabled. */
#define IBUFCON_IBUF_CHOP_BOTH         (0x3   << 4  ) /* Chopping enabled on both buffers. */

/* IBUFCON[IBUF_PD] - Power down P/N InBuf separately */
#define IBUFCON_IBUF_PD_MSK            (0x3   << 2  )
#define IBUFCON_IBUF_PD_NONE           (0x0   << 2  ) /* Both sides powered on    */
#define IBUFCON_IBUF_PD_NSIDE          (0x1   << 2  ) /* only N side powered down */
#define IBUFCON_IBUF_PD_PSIDE          (0x2   << 2  ) /* only P side powered down */
#define IBUFCON_IBUF_PD_BOTH           (0x3   << 2  ) /* Both sides powered down  */

/* IBUFCON[IBUF_BYP] - Bypass P/N InBuf seperately */
#define IBUFCON_IBUF_BYP_MSK           (0x3   << 0  )
#define IBUFCON_IBUF_BYP_NONE          (0x0   << 0  ) /* Bypass none sided        */
#define IBUFCON_IBUF_BYP_NSIDE         (0x1   << 0  ) /* N side bypassed          */
#define IBUFCON_IBUF_BYP_PSIDE         (0x2   << 0  ) /* P side bypassed          */
#define IBUFCON_IBUF_BYP_BOTH          (0x3   << 0  ) /* Bypass both              */
// ------------------------------------------------------------------------------------------------
// -----                                        LV                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_MISC (MMR_LV)
  */

typedef struct MMR_LV {                     /*!< MMR_LV Structure                      */
  __IO uint16_t  LVID;                      /*!< Low voltage die ID                    */
} MMR_LV_t;

/* Reset Value for LVID*/
#define LVID_RVAL                      0x71 

