koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* LVID[LVID] - LVID comes from hardware coded logic */
#define LVID_LVID_MSK                  (0xFFFF << 0  )
// ------------------------------------------------------------------------------------------------
// -----                                        LV_RST                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_MISC (MMR_LV_RST)
  */

typedef struct MMR_LV_RST {                 /*!< MMR_LV_RST Structure                  */
  __IO uint16_t  LVRST;                     /*!< LV die reset configuration            */
} MMR_LV_RST_t;

/* Reset Value for LVRST*/
#define LVRST_RVAL                     0x0 

/* LVRST[RETAIN] - LV retains status after WDT and software reset */
#define LVRST_RETAIN_BBA               (*(volatile unsigned long *) 0x43058680)
#define LVRST_RETAIN_MSK               (0x1   << 0  )
#define LVRST_RETAIN                   (0x1   << 0  )
#define LVRST_RETAIN_EN                (0x0   << 0  ) /* LV die retains status after watchdog or software reset. */
#define LVRST_RETAIN_DIS               (0x1   << 0  ) /* LV die does not retain status after watchdog or software reset. */
// ------------------------------------------------------------------------------------------------
// -----                                        LV_INT                                        -----
// ------------------------------------------------------------------------------------------------


/**
  * @brief LV_INT (MMR_LV_INT)
  */

typedef struct MMR_LV_INT {                 /*!< MMR_LV_INT Structure                  */
  __IO uint16_t  INTCLR;                    /*!< Interrupt clear register              */
  __I  uint16_t  RESERVED0;
  __IO uint16_t  INTSEL;                    /*!< Interrupt mask register               */
  __I  uint16_t  RESERVED1;
  __IO uint16_t  INTSTA;                    /*!< Interrupt status register             */
} MMR_LV_INT_t;

/* Reset Value for INTCLR*/
#define INTCLR_RVAL                    0x0 

/* INTCLR[CLR_WRECC_ERR] - Write 1 to this bit to clear the write ECC error interrupt flag */
#define INTCLR_CLR_WRECC_ERR_BBA       (*(volatile unsigned long *) 0x4306009C)
#define INTCLR_CLR_WRECC_ERR_MSK       (0x1   << 7  )
#define INTCLR_CLR_WRECC_ERR           (0x1   << 7  )
#define INTCLR_CLR_WRECC_ERR_DIS       (0x0   << 7  )
#define INTCLR_CLR_WRECC_ERR_EN        (0x1   << 7  )

/* INTCLR[CLR_RDECC_ERR] - Write 1 to this bit to clear the read ECC error interrupt flag */
#define INTCLR_CLR_RDECC_ERR_BBA       (*(volatile unsigned long *) 0x43060098)
#define INTCLR_CLR_RDECC_ERR_MSK       (0x1   << 6  )
#define INTCLR_CLR_RDECC_ERR           (0x1   << 6  )
#define INTCLR_CLR_RDECC_ERR_DIS       (0x0   << 6  )
#define INTCLR_CLR_RDECC_ERR_EN        (0x1   << 6  )

#if defined(ADUCM320) | defined(ADUCM320I)

/* INTCLR[CLR_IDAC_EXTRESLOW] - Write 1 to this bit to clear the IDAC EXTRESLOW interrupt flag */
#define INTCLR_CLR_IDAC_EXTRESLOW_BBA  (*(volatile unsigned long *) 0x43060094)
#define INTCLR_CLR_IDAC_EXTRESLOW_MSK  (0x1   << 5  )
#define INTCLR_CLR_IDAC_EXTRESLOW      (0x1   << 5  )
#define INTCLR_CLR_IDAC_EXTRESLOW_DIS  (0x0   << 5  )
#define INTCLR_CLR_IDAC_EXTRESLOW_EN   (0x1   << 5  )

/* INTCLR[CLR_IDAC_TSHUT] - Write 1 to this bit to clear the IDAC TSHUT interrupt flag */
#define INTCLR_CLR_IDAC_TSHUT_BBA      (*(volatile unsigned long *) 0x43060090)
#define INTCLR_CLR_IDAC_TSHUT_MSK      (0x1   << 4  )
#define INTCLR_CLR_IDAC_TSHUT          (0x1   << 4  )
#define INTCLR_CLR_IDAC_TSHUT_DIS      (0x0   << 4  )
#define INTCLR_CLR_IDAC_TSHUT_EN       (0x1   << 4  )

#endif

/* INTCLR[CLR_ACOMP] - Write 1 to this bit to clear the analog compare interrupt flag */
#define INTCLR_CLR_ACOMP_BBA           (*(volatile unsigned long *) 0x4306008C)
#define INTCLR_CLR_ACOMP_MSK           (0x1   << 3  )
#define INTCLR_CLR_ACOMP               (0x1   << 3  )
#define INTCLR_CLR_ACOMP_DIS           (0x0   << 3  )
#define INTCLR_CLR_ACOMP_EN            (0x1   << 3  )

/* INTCLR[CLR_DCOMP] - Write 1 to this bit to clear the digital compare interrupt flag */
#define INTCLR_CLR_DCOMP_BBA           (*(volatile unsigned long *) 0x43060088)
#define INTCLR_CLR_DCOMP_MSK           (0x1   << 2  )
#define INTCLR_CLR_DCOMP               (0x1   << 2  )
#define INTCLR_CLR_DCOMP_DIS           (0x0   << 2  )
#define INTCLR_CLR_DCOMP_EN            (0x1   << 2  )

/* INTCLR[CLR_ADC_SEQ] - Write 1 to this bit to clear the ADC sequence conversion interrupt flag */
#define INTCLR_CLR_ADC_SEQ_BBA         (*(volatile unsigned long *) 0x43060084)
#define INTCLR_CLR_ADC_SEQ_MSK         (0x1   << 1  )
#define INTCLR_CLR_ADC_SEQ             (0x1   << 1  )
#define INTCLR_CLR_ADC_SEQ_DIS         (0x0   << 1  )
#define INTCLR_CLR_ADC_SEQ_EN          (0x1   << 1  )

/* INTCLR[CLR_ADC_SOFTCONV] - Write 1 to this bit to clear the ADC software conversion interrupt flag */
#define INTCLR_CLR_ADC_SOFTCONV_BBA    (*(volatile unsigned long *) 0x43060080)
#define INTCLR_CLR_ADC_SOFTCONV_MSK    (0x1   << 0  )
#define INTCLR_CLR_ADC_SOFTCONV        (0x1   << 0  )
#define INTCLR_CLR_ADC_SOFTCONV_DIS    (0x0   << 0  )
#define INTCLR_CLR_ADC_SOFTCONV_EN     (0x1   << 0  )

/* Reset Value for INTSEL*/
#define INTSEL_RVAL                    0x0 

/* INTSEL[SEL_WRECC_ERR_0] - Write 1 to this bit to enable write ECC error interrupt for interrupt pin 0 */
#define INTSEL_SEL_WRECC_ERR_0_BBA     (*(volatile unsigned long *) 0x4306013C)
#define INTSEL_SEL_WRECC_ERR_0_MSK     (0x1   << 15 )
#define INTSEL_SEL_WRECC_ERR_0         (0x1   << 15 )
#define INTSEL_SEL_WRECC_ERR_0_DIS     (0x0   << 15 )
#define INTSEL_SEL_WRECC_ERR_0_EN      (0x1   << 15 )

/* INTSEL[SEL_RDECC_ERR_0] - Write 1 to this bit to enable read ECC error interrupt for interrupt pin 0 */
#define INTSEL_SEL_RDECC_ERR_0_BBA     (*(volatile unsigned long *) 0x43060138)
#define INTSEL_SEL_RDECC_ERR_0_MSK     (0x1   << 14 )
#define INTSEL_SEL_RDECC_ERR_0         (0x1   << 14 )
#define INTSEL_SEL_RDECC_ERR_0_DIS     (0x0   << 14 )
#define INTSEL_SEL_RDECC_ERR_0_EN      (0x1   << 14 )

