koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
#if defined(ADUCM320) | defined(ADUCM320I)

/* INTSEL[SLE_IDAC_EXTRESLOW_0] - Write 1 to this bit to enable IDAC EXTRESLOW interrupt for interrupt pin 0 */
#define INTSEL_SLE_IDAC_EXTRESLOW_0_BBA (*(volatile unsigned long *) 0x43060134)
#define INTSEL_SLE_IDAC_EXTRESLOW_0_MSK (0x1   << 13 )
#define INTSEL_SLE_IDAC_EXTRESLOW_0    (0x1   << 13 )
#define INTSEL_SLE_IDAC_EXTRESLOW_0_DIS (0x0   << 13 )
#define INTSEL_SLE_IDAC_EXTRESLOW_0_EN (0x1   << 13 )

/* INTSEL[SEL_IDAC_TSHUT_0] - Write 1 to this bit to enable IDAC TSHUT interrupt for interrupt pin 0 */
#define INTSEL_SEL_IDAC_TSHUT_0_BBA    (*(volatile unsigned long *) 0x43060130)
#define INTSEL_SEL_IDAC_TSHUT_0_MSK    (0x1   << 12 )
#define INTSEL_SEL_IDAC_TSHUT_0        (0x1   << 12 )
#define INTSEL_SEL_IDAC_TSHUT_0_DIS    (0x0   << 12 )
#define INTSEL_SEL_IDAC_TSHUT_0_EN     (0x1   << 12 )

#endif

/* INTSEL[SEL_ACOMP_0] - Write 1 to this bit to enable analog comparator interrupt for interrupt pin 0 */
#define INTSEL_SEL_ACOMP_0_BBA         (*(volatile unsigned long *) 0x4306012C)
#define INTSEL_SEL_ACOMP_0_MSK         (0x1   << 11 )
#define INTSEL_SEL_ACOMP_0             (0x1   << 11 )
#define INTSEL_SEL_ACOMP_0_DIS         (0x0   << 11 )
#define INTSEL_SEL_ACOMP_0_EN          (0x1   << 11 )

/* INTSEL[SEL_DCOMP_0] - Write 1 to this bit to enable digital comparator interrupt for interrupt pin 0 */
#define INTSEL_SEL_DCOMP_0_BBA         (*(volatile unsigned long *) 0x43060128)
#define INTSEL_SEL_DCOMP_0_MSK         (0x1   << 10 )
#define INTSEL_SEL_DCOMP_0             (0x1   << 10 )
#define INTSEL_SEL_DCOMP_0_DIS         (0x0   << 10 )
#define INTSEL_SEL_DCOMP_0_EN          (0x1   << 10 )

/* INTSEL[SEL_ADC_SEQ_0] - Write 1 to this bit to enable ADC sequence conversion interrupt for interrupt pin 0 */
#define INTSEL_SEL_ADC_SEQ_0_BBA       (*(volatile unsigned long *) 0x43060124)
#define INTSEL_SEL_ADC_SEQ_0_MSK       (0x1   << 9  )
#define INTSEL_SEL_ADC_SEQ_0           (0x1   << 9  )
#define INTSEL_SEL_ADC_SEQ_0_DIS       (0x0   << 9  )
#define INTSEL_SEL_ADC_SEQ_0_EN        (0x1   << 9  )

/* INTSEL[SEL_ADC_SOFTCONV_0] - Write 1 to this bit to enable ADC software conversion interrupt for interrupt pin 0 */
#define INTSEL_SEL_ADC_SOFTCONV_0_BBA  (*(volatile unsigned long *) 0x43060120)
#define INTSEL_SEL_ADC_SOFTCONV_0_MSK  (0x1   << 8  )
#define INTSEL_SEL_ADC_SOFTCONV_0      (0x1   << 8  )
#define INTSEL_SEL_ADC_SOFTCONV_0_DIS  (0x0   << 8  )
#define INTSEL_SEL_ADC_SOFTCONV_0_EN   (0x1   << 8  )

/* INTSEL[SEL_WRECC_ERR_1] - Write 1 to this bit to enable write ECC error interrupt for interrupt pin 1 */
#define INTSEL_SEL_WRECC_ERR_1_BBA     (*(volatile unsigned long *) 0x4306011C)
#define INTSEL_SEL_WRECC_ERR_1_MSK     (0x1   << 7  )
#define INTSEL_SEL_WRECC_ERR_1         (0x1   << 7  )
#define INTSEL_SEL_WRECC_ERR_1_DIS     (0x0   << 7  )
#define INTSEL_SEL_WRECC_ERR_1_EN      (0x1   << 7  )

/* INTSEL[SEL_RDECC_ERR_1] - Write 1 to this bit to enable read ECC error interrupt for interrupt pin 1 */
#define INTSEL_SEL_RDECC_ERR_1_BBA     (*(volatile unsigned long *) 0x43060118)
#define INTSEL_SEL_RDECC_ERR_1_MSK     (0x1   << 6  )
#define INTSEL_SEL_RDECC_ERR_1         (0x1   << 6  )
#define INTSEL_SEL_RDECC_ERR_1_DIS     (0x0   << 6  )
#define INTSEL_SEL_RDECC_ERR_1_EN      (0x1   << 6  )

#if defined(ADUCM320) | defined(ADUCM320I)

/* INTSEL[SLE_IDAC_EXTRESLOW_1] - Write 1 to this bit to enable IDAC EXTRESLOW interrupt for interrupt pin 1 */
#define INTSEL_SLE_IDAC_EXTRESLOW_1_BBA (*(volatile unsigned long *) 0x43060114)
#define INTSEL_SLE_IDAC_EXTRESLOW_1_MSK (0x1   << 5  )
#define INTSEL_SLE_IDAC_EXTRESLOW_1    (0x1   << 5  )
#define INTSEL_SLE_IDAC_EXTRESLOW_1_DIS (0x0   << 5  )
#define INTSEL_SLE_IDAC_EXTRESLOW_1_EN (0x1   << 5  )

/* INTSEL[SEL_IDAC_TSHUT_1] - Write 1 to this bit to enable IDAC TSHUT interrupt for interrupt pin 1 */
#define INTSEL_SEL_IDAC_TSHUT_1_BBA    (*(volatile unsigned long *) 0x43060110)
#define INTSEL_SEL_IDAC_TSHUT_1_MSK    (0x1   << 4  )
#define INTSEL_SEL_IDAC_TSHUT_1        (0x1   << 4  )
#define INTSEL_SEL_IDAC_TSHUT_1_DIS    (0x0   << 4  )
#define INTSEL_SEL_IDAC_TSHUT_1_EN     (0x1   << 4  )

#endif

/* INTSEL[SEL_ACOMP_1] - Write 1 to this bit to enable analog comparator interrupt for interrupt pin 1 */
#define INTSEL_SEL_ACOMP_1_BBA         (*(volatile unsigned long *) 0x4306010C)
#define INTSEL_SEL_ACOMP_1_MSK         (0x1   << 3  )
#define INTSEL_SEL_ACOMP_1             (0x1   << 3  )
#define INTSEL_SEL_ACOMP_1_DIS         (0x0   << 3  )
#define INTSEL_SEL_ACOMP_1_EN          (0x1   << 3  )

/* INTSEL[SEL_DCOMP_1] - Write 1 to this bit to enable digital comparator interrupt for interrupt pin 1 */
#define INTSEL_SEL_DCOMP_1_BBA         (*(volatile unsigned long *) 0x43060108)
#define INTSEL_SEL_DCOMP_1_MSK         (0x1   << 2  )
#define INTSEL_SEL_DCOMP_1             (0x1   << 2  )
#define INTSEL_SEL_DCOMP_1_DIS         (0x0   << 2  )
#define INTSEL_SEL_DCOMP_1_EN          (0x1   << 2  )

/* INTSEL[SEL_ADC_SEQ_1] - Write 1 to this bit to enable ADC sequence conversion interrupt for interrupt pin 1 */
#define INTSEL_SEL_ADC_SEQ_1_BBA       (*(volatile unsigned long *) 0x43060104)
#define INTSEL_SEL_ADC_SEQ_1_MSK       (0x1   << 1  )
#define INTSEL_SEL_ADC_SEQ_1           (0x1   << 1  )
#define INTSEL_SEL_ADC_SEQ_1_DIS       (0x0   << 1  )
#define INTSEL_SEL_ADC_SEQ_1_EN        (0x1   << 1  )

/* INTSEL[SEL_ADC_SOFTCONV_1] - Write 1 to this bit to enable ADC software conversion interrupt for interrupt pin 1 */
#define INTSEL_SEL_ADC_SOFTCONV_1_BBA  (*(volatile unsigned long *) 0x43060100)
#define INTSEL_SEL_ADC_SOFTCONV_1_MSK  (0x1   << 0  )
#define INTSEL_SEL_ADC_SOFTCONV_1      (0x1   << 0  )
#define INTSEL_SEL_ADC_SOFTCONV_1_DIS  (0x0   << 0  )
#define INTSEL_SEL_ADC_SOFTCONV_1_EN   (0x1   << 0  )

/* Reset Value for INTSTA*/
#define INTSTA_RVAL                    0x0 

/* INTSTA[WRECC_ERR] - Write data ECC error interrupt status */
#define INTSTA_WRECC_ERR_BBA           (*(volatile unsigned long *) 0x4306019C)
#define INTSTA_WRECC_ERR_MSK           (0x1   << 7  )
#define INTSTA_WRECC_ERR               (0x1   << 7  )
#define INTSTA_WRECC_ERR_CLR           (0x0   << 7  )
#define INTSTA_WRECC_ERR_SET           (0x1   << 7  )

