koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* INTSTA[RDECC_ERR] - Read data ECC error interrupt status */
#define INTSTA_RDECC_ERR_BBA           (*(volatile unsigned long *) 0x43060198)
#define INTSTA_RDECC_ERR_MSK           (0x1   << 6  )
#define INTSTA_RDECC_ERR               (0x1   << 6  )
#define INTSTA_RDECC_ERR_CLR           (0x0   << 6  )
#define INTSTA_RDECC_ERR_SET           (0x1   << 6  )

#if defined(ADUCM320) | defined(ADUCM320I)

/* INTSTA[IDAC_EXTRESLOW] - IDAC EXTRESLOW interrupt status */
#define INTSTA_IDAC_EXTRESLOW_BBA      (*(volatile unsigned long *) 0x43060194)
#define INTSTA_IDAC_EXTRESLOW_MSK      (0x1   << 5  )
#define INTSTA_IDAC_EXTRESLOW          (0x1   << 5  )
#define INTSTA_IDAC_EXTRESLOW_CLR      (0x0   << 5  )
#define INTSTA_IDAC_EXTRESLOW_SET      (0x1   << 5  )

/* INTSTA[IDAC_TSHUT] - IDAC temperature TSHT interrupt status */
#define INTSTA_IDAC_TSHUT_BBA          (*(volatile unsigned long *) 0x43060190)
#define INTSTA_IDAC_TSHUT_MSK          (0x1   << 4  )
#define INTSTA_IDAC_TSHUT              (0x1   << 4  )
#define INTSTA_IDAC_TSHUT_CLR          (0x0   << 4  )
#define INTSTA_IDAC_TSHUT_SET          (0x1   << 4  )

#endif

/* INTSTA[ACOMP] - Analog comparator interrupt status */
#define INTSTA_ACOMP_BBA               (*(volatile unsigned long *) 0x4306018C)
#define INTSTA_ACOMP_MSK               (0x1   << 3  )
#define INTSTA_ACOMP                   (0x1   << 3  )
#define INTSTA_ACOMP_CLR               (0x0   << 3  )
#define INTSTA_ACOMP_SET               (0x1   << 3  )

/* INTSTA[DCOMP] - Digital comparator interrupt status */
#define INTSTA_DCOMP_BBA               (*(volatile unsigned long *) 0x43060188)
#define INTSTA_DCOMP_MSK               (0x1   << 2  )
#define INTSTA_DCOMP                   (0x1   << 2  )
#define INTSTA_DCOMP_CLR               (0x0   << 2  )
#define INTSTA_DCOMP_SET               (0x1   << 2  )

/* INTSTA[ADC_SEQ] - ADC sequence interrupt status */
#define INTSTA_ADC_SEQ_BBA             (*(volatile unsigned long *) 0x43060184)
#define INTSTA_ADC_SEQ_MSK             (0x1   << 1  )
#define INTSTA_ADC_SEQ                 (0x1   << 1  )
#define INTSTA_ADC_SEQ_CLR             (0x0   << 1  )
#define INTSTA_ADC_SEQ_SET             (0x1   << 1  )

/* INTSTA[ADC_SOFTCONV] - ADC software conversion  interrupt status */
#define INTSTA_ADC_SOFTCONV_BBA        (*(volatile unsigned long *) 0x43060180)
#define INTSTA_ADC_SOFTCONV_MSK        (0x1   << 0  )
#define INTSTA_ADC_SOFTCONV            (0x1   << 0  )
#define INTSTA_ADC_SOFTCONV_CLR        (0x0   << 0  )
#define INTSTA_ADC_SOFTCONV_SET        (0x1   << 0  )


#if defined(ADUCM320) | defined(ADUCM320I)

// ------------------------------------------------------------------------------------------------
// -----                                        IDAC                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief IDAC (MMR_IDAC)
  */

typedef struct MMR_IDAC {             /*!< MMR_IDAC Structure                 */
  __IOM uint32_t  IDACDAT;            /*!< IDAC data register                 */
  __IOM uint8_t   IDACCON;            /*!< IDAC control register              */
  __IM  uint8_t   RESERVED0[3];
} MMR_IDAC_t;

/* Reset Value for IDAC0DAT*/
#define IDAC0DAT_RVAL                  0x0 

/* IDAC0DAT[DATH] - IDAC0 high data */
#define IDAC0DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC0DAT[DATL] - IDAC0 low data */
#define IDAC0DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC0DAT[SYNC] - IDAC0 sync bits */
#define IDAC0DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC0CON*/
#define IDAC0CON_RVAL                  0x1 

/* IDAC0CON[CLRB] - IDAC0 Clear bit */
#define IDAC0CON_CLRB_BBA              (*(volatile unsigned long *) 0x430D009C)
#define IDAC0CON_CLRB_MSK              (0x1   << 7  )
#define IDAC0CON_CLRB                  (0x1   << 7  )

/* IDAC0CON[SHT_EN] - IDAC0 shutdown enable */
#define IDAC0CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0098)
#define IDAC0CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC0CON_SHT_EN                (0x1   << 6  )

/* IDAC0CON[BW] - IDAC0 bandwidth */
#define IDAC0CON_BW_MSK                (0xF   << 2  )

/* IDAC0CON[PUL] - IDAC0 pull down */
#define IDAC0CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0084)
#define IDAC0CON_PUL_MSK               (0x1   << 1  )
#define IDAC0CON_PUL                   (0x1   << 1  )

/* IDAC0CON[PD] - IDAC0 power down */
#define IDAC0CON_PD_BBA                (*(volatile unsigned long *) 0x430D0080)
#define IDAC0CON_PD_MSK                (0x1   << 0  )
#define IDAC0CON_PD                    (0x1   << 0  )
#define IDAC0CON_PD_ON                 (0x0   << 0  ) /* Powers IDAC0 up          */
#define IDAC0CON_PD_OFF                (0x1   << 0  ) /* Powers IDAC0 down        */

/* Reset Value for IDAC1DAT*/
#define IDAC1DAT_RVAL                  0x0 

/* IDAC1DAT[DATH] - IDAC1 high data */
#define IDAC1DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC1DAT[DATL] - IDAC1 low data */
#define IDAC1DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC1DAT[SYNC] - IDAC1 sync bits */
#define IDAC1DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC1CON*/
#define IDAC1CON_RVAL                  0x1 

/* IDAC1CON[CLRB] - IDAC1 Clear bit */
#define IDAC1CON_CLRB_BBA              (*(volatile unsigned long *) 0x430D019C)
#define IDAC1CON_CLRB_MSK              (0x1   << 7  )
#define IDAC1CON_CLRB                  (0x1   << 7  )

/* IDAC1CON[SHT_EN] - IDAC1 shutdown enable */
#define IDAC1CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0198)
#define IDAC1CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC1CON_SHT_EN                (0x1   << 6  )

/* IDAC1CON[BW] - IDAC1 bandwidth */
#define IDAC1CON_BW_MSK                (0xF   << 2  )

/* IDAC1CON[PUL] - IDAC1 pull down */
#define IDAC1CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0184)
#define IDAC1CON_PUL_MSK               (0x1   << 1  )
#define IDAC1CON_PUL                   (0x1   << 1  )

/* IDAC1CON[PD] - IDAC1 power down */
#define IDAC1CON_PD_BBA                (*(volatile unsigned long *) 0x430D0180)
#define IDAC1CON_PD_MSK                (0x1   << 0  )
#define IDAC1CON_PD                    (0x1   << 0  )
#define IDAC1CON_PD_OFF                (0x0   << 0  ) /* Powers IDAC1 up          */
#define IDAC1CON_PD_ON                 (0x1   << 0  ) /* Powers IDAC1 down        */

/* Reset Value for IDAC2DAT*/
#define IDAC2DAT_RVAL                  0x0 

/* IDAC2DAT[DATH] - IDAC2 high data */
#define IDAC2DAT_DATH_MSK              (0x7FF << 17 )

