koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* IDAC2DAT[DATL] - IDAC2 low data */
#define IDAC2DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC2DAT[SYNC] - IDAC2 sync bits */
#define IDAC2DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC2CON*/
#define IDAC2CON_RVAL                  0x1 

/* IDAC2CON[CLR] - IDAC2 Clear bit */
#define IDAC2CON_CLR_BBA               (*(volatile unsigned long *) 0x430D029C)
#define IDAC2CON_CLR_MSK               (0x1   << 7  )
#define IDAC2CON_CLR                   (0x1   << 7  )

/* IDAC2CON[SHT_EN] - IDAC2 shutdown enable */
#define IDAC2CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0298)
#define IDAC2CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC2CON_SHT_EN                (0x1   << 6  )

/* IDAC2CON[BW] - IDAC2 bandwidth */
#define IDAC2CON_BW_MSK                (0xF   << 2  )

/* IDAC2CON[PUL] - IDAC2 pull down */
#define IDAC2CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0284)
#define IDAC2CON_PUL_MSK               (0x1   << 1  )
#define IDAC2CON_PUL                   (0x1   << 1  )

/* IDAC2CON[PD] - IDAC2 power down */
#define IDAC2CON_PD_BBA                (*(volatile unsigned long *) 0x430D0280)
#define IDAC2CON_PD_MSK                (0x1   << 0  )
#define IDAC2CON_PD                    (0x1   << 0  )
#define IDAC2CON_PD_OFF                (0x0   << 0  ) /* Powers IDAC2 up          */
#define IDAC2CON_PD_ON                 (0x1   << 0  ) /* Powers IDAC2 down        */

/* Reset Value for IDAC3DAT*/
#define IDAC3DAT_RVAL                  0x0 

/* IDAC3DAT[DATH] - IDAC3 high data */
#define IDAC3DAT_DATH_MSK              (0x7FF << 17 )

/* IDAC3DAT[DATL] - IDAC3 low data */
#define IDAC3DAT_DATL_MSK              (0x1F  << 12 )

/* IDAC3DAT[SYNC] - IDAC3 sync bits */
#define IDAC3DAT_SYNC_MSK              (0x3F  << 0  )

/* Reset Value for IDAC3CON*/
#define IDAC3CON_RVAL                  0x1 

/* IDAC3CON[CLR] - IDAC3 Clear bit */
#define IDAC3CON_CLR_BBA               (*(volatile unsigned long *) 0x430D039C)
#define IDAC3CON_CLR_MSK               (0x1   << 7  )
#define IDAC3CON_CLR                   (0x1   << 7  )

/* IDAC3CON[SHT_EN] - IDAC3 shutdown enable */
#define IDAC3CON_SHT_EN_BBA            (*(volatile unsigned long *) 0x430D0398)
#define IDAC3CON_SHT_EN_MSK            (0x1   << 6  )
#define IDAC3CON_SHT_EN                (0x1   << 6  )

/* IDAC3CON[BW] - IDAC3 bandwidth */
#define IDAC3CON_BW_MSK                (0xF   << 2  )

/* IDAC3CON[PUL] - IDAC3 pull down */
#define IDAC3CON_PUL_BBA               (*(volatile unsigned long *) 0x430D0384)
#define IDAC3CON_PUL_MSK               (0x1   << 1  )
#define IDAC3CON_PUL                   (0x1   << 1  )

/* IDAC3CON[PD] - IDAC3 power down */
#define IDAC3CON_PD_BBA                (*(volatile unsigned long *) 0x430D0380)
#define IDAC3CON_PD_MSK                (0x1   << 0  )
#define IDAC3CON_PD                    (0x1   << 0  )
#define IDAC3CON_PD_OFF                (0x0   << 0  ) /* Powers IDAC3 up          */
#define IDAC3CON_PD_ON                 (0x1   << 0  ) /* Powers IDAC3 down        */

#endif


// ------------------------------------------------------------------------------------------------
// -----                                        AFE                                        -----
// ------------------------------------------------------------------------------------------------

/**
  * @brief comp_ldo_por_reftop_temp (MMR_AFE)
  */

typedef struct MMR_AFE {                    /*!< MMR_AFE Structure                     */
  __IO uint8_t   AFETEMPC;                  /*!< Temp sensor configuration register    */
  __I  uint8_t   RESERVED0[3];
  __IO uint8_t   AFEREFC;                   /*!< Reference configuration register      */
  __I  uint8_t   RESERVED1[3];
  __IO uint16_t  AFECOMP;                   /*!< Analog comparator configuration register */
} MMR_AFE_t;

/* Reset Value for AFETEMPC*/
#define AFETEMPC_RVAL                  0x0 

/* AFETEMPC[CHOP] - Temperature sensor chopping enable. */
#define AFETEMPC_CHOP_BBA              (*(volatile unsigned long *) 0x430F0604)
#define AFETEMPC_CHOP_MSK              (0x1   << 1  )
#define AFETEMPC_CHOP                  (0x1   << 1  )
#define AFETEMPC_CHOP_DIS              (0x0   << 1  ) /* Disable chopping mode    */
#define AFETEMPC_CHOP_EN               (0x1   << 1  ) /* Enable chopping mode     */

/* AFETEMPC[PD] - Temperature sensor power down. */
#define AFETEMPC_PD_BBA                (*(volatile unsigned long *) 0x430F0600)
#define AFETEMPC_PD_MSK                (0x1   << 0  )
#define AFETEMPC_PD                    (0x1   << 0  )
#define AFETEMPC_PD_DIS                (0x0   << 0  ) /* Power up temp sensor     */
#define AFETEMPC_PD_EN                 (0x1   << 0  ) /* Power down temp sensor   */

/* Reset Value for AFEREFC*/
#define AFEREFC_RVAL                   0x0 

/* AFEREFC[B2MA_PDA] - Power down the reference 2mA output driving buffer A. */
#define AFEREFC_B2MA_PDA_BBA           (*(volatile unsigned long *) 0x430F0698)
#define AFEREFC_B2MA_PDA_MSK           (0x1   << 6  )
#define AFEREFC_B2MA_PDA               (0x1   << 6  )
#define AFEREFC_B2MA_PDA_DIS           (0x0   << 6  ) /* Power up 2.5 V reference output driving buffer A */
#define AFEREFC_B2MA_PDA_EN            (0x1   << 6  ) /* Power down 2.5 V reference output driving buffer A */

/* AFEREFC[REF] - bypass the internal reference, and select the external reference. */
#define AFEREFC_REF_BBA                (*(volatile unsigned long *) 0x430F068C)
#define AFEREFC_REF_MSK                (0x1   << 3  )
#define AFEREFC_REF                    (0x1   << 3  )
#define AFEREFC_REF_INT                (0x0   << 3  ) /* Select internal 2.5v reference */
#define AFEREFC_REF_EXT                (0x1   << 3  ) /* Select external 2.5v reference */

/* AFEREFC[B2MA_PDB] - Power down the reference 2mA output driving buffer B. */
#define AFEREFC_B2MA_PDB_BBA           (*(volatile unsigned long *) 0x430F0688)
#define AFEREFC_B2MA_PDB_MSK           (0x1   << 2  )
#define AFEREFC_B2MA_PDB               (0x1   << 2  )
#define AFEREFC_B2MA_PDB_DIS           (0x0   << 2  ) /* Power up 2.5 V reference output driving buffer B */
#define AFEREFC_B2MA_PDB_EN            (0x1   << 2  ) /* Power down 2.5 V reference output driving buffer B */

/* AFEREFC[B2V5R_PD] - 2.5v reference buffer power down */
#define AFEREFC_B2V5R_PD_BBA           (*(volatile unsigned long *) 0x430F0684)
#define AFEREFC_B2V5R_PD_MSK           (0x1   << 1  )
#define AFEREFC_B2V5R_PD               (0x1   << 1  )
#define AFEREFC_B2V5R_PD_DIS           (0x0   << 1  ) /* Power up 2.5 V reference buffer */
#define AFEREFC_B2V5R_PD_EN            (0x1   << 1  ) /* Power down 2.5 V reference buffer */

/* AFEREFC[BG_PD] - Bandgap power down */
#define AFEREFC_BG_PD_BBA              (*(volatile unsigned long *) 0x430F0680)
#define AFEREFC_BG_PD_MSK              (0x1   << 0  )
#define AFEREFC_BG_PD                  (0x1   << 0  )
#define AFEREFC_BG_PD_DIS              (0x0   << 0  ) /* Power up 1.2 V bandgap   */
#define AFEREFC_BG_PD_EN               (0x1   << 0  ) /* Power down 1.2 V bandgap */

/* Reset Value for AFECOMP*/
#define AFECOMP_RVAL                   0x0 

/* AFECOMP[EN] - Powers up and enables comparator */
#define AFECOMP_EN_BBA                 (*(volatile unsigned long *) 0x430F0720)
#define AFECOMP_EN_MSK                 (0x1   << 8  )
#define AFECOMP_EN                     (0x1   << 8  )
#define AFECOMP_EN_DIS                 (0x0   << 8  ) /* Power down and disable comparator */
#define AFECOMP_EN_EN                  (0x1   << 8  ) /* Power up and enable comparator */

