koshkin-sergey/mbOS/Device/ADI/ADuCM32x/Include/asm/aducm32x.h
/* AFECOMP[INNEG] - Selects comparator negative input signal. */
#define AFECOMP_INNEG_MSK              (0x3   << 6  )
#define AFECOMP_INNEG_AVDD2            (0x0   << 6  ) /* AVDD/2                   */
#define AFECOMP_INNEG_AIN5             (0x1   << 6  ) /* AIN5                     */
#define AFECOMP_INNEG_DAC7             (0x2   << 6  ) /* DAC7                     */

/* AFECOMP[OUT] - Connects comparator output to interrupt logic. */
#define AFECOMP_OUT_MSK                (0x3   << 4  )
#define AFECOMP_OUT_DIS                (0x0   << 4  ) /* Do not connect output    */
#define AFECOMP_OUT_EN                 (0x1   << 4  ) /* Connect output to interrupt logic */

/* AFECOMP[INV] - Selects output logic state. */
#define AFECOMP_INV_BBA                (*(volatile unsigned long *) 0x430F070C)
#define AFECOMP_INV_MSK                (0x1   << 3  )
#define AFECOMP_INV                    (0x1   << 3  )
#define AFECOMP_INV_NO                 (0x0   << 3  ) /* Output will be high if +ve input is above -ve input. */
#define AFECOMP_INV_YES                (0x1   << 3  ) /* Output will be high if +ve input is below -ve input. */

/* AFECOMP[SPEED] - Selects comparator speed. */
#define AFECOMP_SPEED_MSK              (0x3   << 1  )
#define AFECOMP_SPEED_SPEED6           (0x0   << 1  ) /* 6.00us                   */
#define AFECOMP_SPEED_SPEED3           (0x1   << 1  ) /* 3.25us                   */
#define AFECOMP_SPEED_SPEED2           (0x2   << 1  ) /* 1.75us                   */
#define AFECOMP_SPEED_SPEED1           (0x3   << 1  ) /* 1.00us                   */

/* AFECOMP[HYS] - Enables comparator hysteresis */
#define AFECOMP_HYS_BBA                (*(volatile unsigned long *) 0x430F0700)
#define AFECOMP_HYS_MSK                (0x1   << 0  )
#define AFECOMP_HYS                    (0x1   << 0  )
#define AFECOMP_HYS_DIS                (0x0   << 0  ) /* Disable hysteresis       */
#define AFECOMP_HYS_EN                 (0x1   << 0  ) /* Enable  hysteresis       */

/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif


/* ========================================================================== */
/* =============              Peripheral memory map             ============= */
/* ========================================================================== */

#define MMR_TMR0_ADDR                            0x40000000UL
#define MMR_TMR1_ADDR                            0x40000400UL
#define MMR_TMR2_ADDR                            0x40000800UL
#define MMR_ID_ADDR                              0x40002024UL
#define MMR_PWRCTL_ADDR                          0x40002400UL
#define MMR_RESET_ADDR                           0x40002408UL
#define MMR_EXTI_ADDR                            0x40002420UL
#define MMR_WDT_ADDR                             0x40002580UL
#define MMR_WUT_ADDR                             0x40002500UL
#define MMR_I2C0_ADDR                            0x40003000UL
#define MMR_I2C1_ADDR                            0x40003400UL
#define MMR_UART_ADDR                            0x40005000UL
#define MMR_MDIO_ADDR                            0x40005C00UL
#define MMR_PLA_ADDR                             0x40005800UL
#define MMR_DMA_ADDR                             0x40010000UL
#define MMR_FEE_ADDR                             0x40018000UL
#define MMR_GPIO0_ADDR                           0x40020000UL
#define MMR_GPIO1_ADDR                           0x40020040UL
#define MMR_GPIO2_ADDR                           0x40020080UL
#define MMR_GPIO3_ADDR                           0x400200C0UL
#define MMR_GPIO4_ADDR                           0x40020100UL
#define MMR_GPIO5_ADDR                           0x40020240UL
#define MMR_PWM_ADDR                             0x40024000UL
#define MMR_CLKCTL_ADDR                          0x40028000UL
#define MMR_DMACTL_ADDR                          0x40028100UL
#define MMR_SPI0_ADDR                            0x4002C000UL
#define MMR_SPI1_ADDR                            0x40030000UL
#define MMR_ADC_ADDR                             0x40082174UL
#define MMR_VDAC0_ADDR                           0x40082400UL
#define MMR_VDAC1_ADDR                           0x40082404UL
#define MMR_VDAC2_ADDR                           0x40082408UL
#define MMR_VDAC3_ADDR                           0x4008240CUL
#define MMR_VDAC4_ADDR                           0x40082410UL
#define MMR_VDAC5_ADDR                           0x40082414UL
#define MMR_VDAC6_ADDR                           0x40082418UL
#define MMR_VDAC7_ADDR                           0x4008241CUL
#define MMR_INBUF_ADDR                           0x40081400UL
#define MMR_LV_ADDR                              0x40082C30UL
#define MMR_LV_RST_ADDR                          0x40082C34UL
#define MMR_LV_INT_ADDR                          0x40083004UL
#if defined(ADUCM320) | defined(ADUCM320I)
#define MMR_IDAC0_ADDR                           0x40086800UL
#define MMR_IDAC1_ADDR                           0x40086808UL
#define MMR_IDAC2_ADDR                           0x40086810UL
#define MMR_IDAC3_ADDR                           0x40086818UL
#endif
#define MMR_AFE_ADDR                             0x40087830UL


/* ========================================================================== */
/* =============             Peripheral declaration             ============= */
/* ========================================================================== */

#define MMR_TMR0                  ((MMR_TIMER_t     *)MMR_TMR0_ADDR)
#define MMR_TMR1                  ((MMR_TIMER_t     *)MMR_TMR1_ADDR)
#define MMR_TMR2                  ((MMR_TIMER_t     *)MMR_TMR2_ADDR)
#define MMR_ID                    ((MMR_ID_t        *)MMR_ID_ADDR)
#define MMR_PWRCTL                ((MMR_PWRCTL_t    *)MMR_PWRCTL_ADDR)
#define MMR_RESET                 ((MMR_RESET_t     *)MMR_RESET_ADDR)
#define MMR_EXTI                  ((MMR_EXTI_t      *)MMR_EXTI_ADDR)
#define MMR_WDT                   ((MMR_WDT_t       *)MMR_WDT_ADDR)
#define MMR_WUT                   ((MMR_WUT_t       *)MMR_WUT_ADDR)
#define MMR_I2C0                  ((MMR_I2C_t       *)MMR_I2C0_ADDR)
#define MMR_I2C1                  ((MMR_I2C_t       *)MMR_I2C1_ADDR)
#define MMR_UART                  ((MMR_UART_t      *)MMR_UART_ADDR)
#define MMR_MDIO                  ((MMR_MDIO_t      *)MMR_MDIO_ADDR)
#define MMR_PLA                   ((MMR_PLA_t       *)MMR_PLA_ADDR)
#define MMR_DMA                   ((MMR_DMA_t       *)MMR_DMA_ADDR)
#define MMR_FEE                   ((MMR_FEE_t       *)MMR_FEE_ADDR)
#define MMR_GPIO0                 ((MMR_GPIO_t      *)MMR_GPIO0_ADDR)
#define MMR_GPIO1                 ((MMR_GPIO_t      *)MMR_GPIO1_ADDR)
#define MMR_GPIO2                 ((MMR_GPIO_t      *)MMR_GPIO2_ADDR)
#define MMR_GPIO3                 ((MMR_GPIO_t      *)MMR_GPIO3_ADDR)
#define MMR_GPIO4                 ((MMR_GPIO_t      *)MMR_GPIO4_ADDR)
#define MMR_GPIO5                 ((MMR_GPIO_t      *)MMR_GPIO5_ADDR)
#define MMR_PWM                   ((MMR_PWM_t       *)MMR_PWM_ADDR)
#define MMR_CLKCTL                ((MMR_CLKCTL_t    *)MMR_CLKCTL_ADDR)
#define MMR_dma_ctl               ((MMR_DMACTL_t    *)MMR_DMACTL_ADDR)
#define MMR_SPI0                  ((MMR_SPI_t       *)MMR_SPI0_ADDR)
#define MMR_SPI1                  ((MMR_SPI_t       *)MMR_SPI1_ADDR)
#define MMR_ADC                   ((MMR_ADC_t       *)MMR_ADC_ADDR)
#define MMR_VDAC0                 ((MMR_VDAC_t      *)MMR_VDAC0_ADDR)
#define MMR_VDAC1                 ((MMR_VDAC_t      *)MMR_VDAC1_ADDR)
#define MMR_VDAC2                 ((MMR_VDAC_t      *)MMR_VDAC2_ADDR)
#define MMR_VDAC3                 ((MMR_VDAC_t      *)MMR_VDAC3_ADDR)
#define MMR_VDAC4                 ((MMR_VDAC_t      *)MMR_VDAC4_ADDR)
#define MMR_VDAC5                 ((MMR_VDAC_t      *)MMR_VDAC5_ADDR)
#define MMR_VDAC6                 ((MMR_VDAC_t      *)MMR_VDAC6_ADDR)
#define MMR_VDAC7                 ((MMR_VDAC_t      *)MMR_VDAC7_ADDR)
#define MMR_InBuf                 ((MMR_INBUF_t     *)MMR_INBUF_ADDR)
#define MMR_LV                    ((MMR_LV_t        *)MMR_LV_ADDR)
#define MMR_LV_RST                ((MMR_LV_RST_t    *)MMR_LV_RST_ADDR)
#define MMR_LV_INT                ((MMR_LV_INT_t    *)MMR_LV_INT_ADDR)
#if defined(ADUCM320) | defined(ADUCM320I)
#define MMR_IDAC0                 ((MMR_IDAC_t      *)MMR_IDAC0_ADDR)
#define MMR_IDAC1                 ((MMR_IDAC_t      *)MMR_IDAC1_ADDR)
#define MMR_IDAC2                 ((MMR_IDAC_t      *)MMR_IDAC2_ADDR)
#define MMR_IDAC3                 ((MMR_IDAC_t      *)MMR_IDAC3_ADDR)
#endif
#define MMR_AFE                   ((MMR_AFE_t       *)MMR_AFE_ADDR)

/** @} */ /* End of group Device_Peripheral_Registers */
/** @} */ /* End of group ADUCM32x */
/** @} */ /* End of group CMSIS */

#ifdef __cplusplus
}
#endif 

#endif  // ADUCM32x_H_
